torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2012 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 *published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 ******************************************************************************/
#include <drv_types.h>
#include <rtl8723a_hal.h>
#include <rtw_ioctl_set.h>

#define DIS_PS_RX_BCN

#ifdef CONFIG_8723AU_BT_COEXIST

u32 BTCoexDbgLevel = _bt_dbg_off_;

#define RTPRINT(_Comp, _Level, Fmt)\
do {\
	if ((BTCoexDbgLevel == _bt_dbg_on_)) {\
		printk Fmt;\
	}					\
} while (0)

#define RTPRINT_ADDR(dbgtype, dbgflag, printstr, _Ptr)\
if ((BTCoexDbgLevel == _bt_dbg_on_)) {\
	u32 __i;						\
	u8 *ptr = (u8 *)_Ptr;	\
	printk printstr;				\
	printk(" ");					\
	for (__i = 0; __i < 6; __i++)		\
		printk("%02X%s", ptr[__i], (__i == 5)?"":"-");		\
	printk("\n");							\
}
#define RTPRINT_DATA(dbgtype, dbgflag, _TitleString, _HexData, _HexDataLen)\
if ((BTCoexDbgLevel == _bt_dbg_on_)) {\
	u32 __i;						\
	u8 *ptr = (u8 *)_HexData;				\
	printk(_TitleString);					\
	for (__i = 0; __i < (u32)_HexDataLen; __i++) {		\
		printk("%02X%s", ptr[__i], (((__i + 1) % 4) == 0)?"  ":" ");\
		if (((__i + 1) % 16) == 0)			\
			printk("\n");				\
	}								\
	printk("\n");							\
}
/*  Added by Annie, 2005-11-22. */
#define MAX_STR_LEN	64
/*  I want to see ASCII 33 to 126 only. Otherwise, I print '?'. */
#define PRINTABLE(_ch)	(_ch >= ' ' && _ch <= '~')
#define RT_PRINT_STR(_Comp, _Level, _TitleString, _Ptr, _Len)		\
	{								\
		u32 __i;						\
		u8 buffer[MAX_STR_LEN];					\
		u32 length = (_Len < MAX_STR_LEN) ? _Len : (MAX_STR_LEN-1);\
		memset(buffer, 0, MAX_STR_LEN);				\
		memcpy(buffer, (u8 *)_Ptr, length);			\
		for (__i = 0; __i < length; __i++) {			\
			if (!PRINTABLE(buffer[__i]))			\
				buffer[__i] = '?';			\
		}							\
		buffer[length] = '\0';					\
		printk(_TitleString);					\
		printk(": %d, <%s>\n", _Len, buffer);			\
	}
#endif

#define DCMD_Printf(...)
#define RT_ASSERT(...)

#define rsprintf snprintf

#define GetDefaultAdapter(padapter)	padapter

#define PlatformZeroMemory(ptr, sz)	memset(ptr, 0, sz)

#define PlatformProcessHCICommands(...)
#define PlatformTxBTQueuedPackets(...)
#define PlatformIndicateBTACLData(...)	(RT_STATUS_SUCCESS)
#define PlatformAcquireSpinLock(padapter, type)
#define PlatformReleaseSpinLock(padapter, type)

#define GET_UNDECORATED_AVERAGE_RSSI(padapter)	\
			(GET_HAL_DATA(padapter)->dmpriv.EntryMinUndecoratedSmoothedPWDB)
#define RT_RF_CHANGE_SOURCE u32

enum {
	RT_JOIN_INFRA   = 1,
	RT_JOIN_IBSS  = 2,
	RT_START_IBSS = 3,
	RT_NO_ACTION  = 4,
};

/*  power saving */

#ifdef __BT_C__ /*  COMMOM/BT.c */
/*  ===== Below this line is sync from SD7 driver COMMOM/BT.c ===== */

static u8 BT_Operation(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	if (pBtMgnt->BtOperationOn)
		return true;
	else
		return false;
}

static u8 BT_IsLegalChannel(struct rtw_adapter *padapter, u8 channel)
{
	struct rt_channel_info *pChanneList = NULL;
	u8 channelLen, i;

	pChanneList = padapter->mlmeextpriv.channel_set;
	channelLen = padapter->mlmeextpriv.max_chan_nums;

	for (i = 0; i < channelLen; i++) {
		RTPRINT(FIOCTL, IOCTL_STATE,
			("Check if chnl(%d) in channel plan contains bt target chnl(%d) for BT connection\n",
			 pChanneList[i].ChannelNum, channel));
		if ((channel == pChanneList[i].ChannelNum) ||
		    (channel == pChanneList[i].ChannelNum + 2))
			return channel;
	}
	return 0;
}

void BT_SignalCompensation(struct rtw_adapter *padapter, u8 *rssi_wifi, u8 *rssi_bt)
{
	BTDM_SignalCompensation(padapter, rssi_wifi, rssi_bt);
}

void BT_WifiScanNotify(struct rtw_adapter *padapter, u8 scanType)
{
	BTHCI_WifiScanNotify(padapter, scanType);
	BTDM_CheckAntSelMode(padapter);
	BTDM_WifiScanNotify(padapter, scanType);
}

void BT_WifiAssociateNotify(struct rtw_adapter *padapter, u8 action)
{
	/*  action : */
	/*  true = associate start */
	/*  false = associate finished */
	if (action)
		BTDM_CheckAntSelMode(padapter);

	BTDM_WifiAssociateNotify(padapter, action);
}

void BT_WifiMediaStatusNotify(struct rtw_adapter *padapter, enum rt_media_status mstatus)
{
	BTDM_MediaStatusNotify(padapter, mstatus);
}

void BT_SpecialPacketNotify(struct rtw_adapter *padapter)
{
	BTDM_ForDhcp(padapter);
}

void BT_HaltProcess(struct rtw_adapter *padapter)
{
	BTDM_ForHalt(padapter);
}

void BT_LpsLeave(struct rtw_adapter *padapter)
{
	BTDM_LpsLeave(padapter);
}

/*  ===== End of sync from SD7 driver COMMOM/BT.c ===== */
#endif

#ifdef __BT_HANDLEPACKET_C__ /*  COMMOM/bt_handlepacket.c */
/*  ===== Below this line is sync from SD7 driver COMMOM/bt_handlepacket.c ===== */

/*  ===== End of sync from SD7 driver COMMOM/bt_handlepacket.c ===== */
#endif

#ifdef __BT_HCI_C__ /*  COMMOM/bt_hci.c */

#define i64fmt		"ll"
#define UINT64_C(v)  (v)

#define FillOctetString(_os, _octet, _len)		\
	(_os).Octet = (u8 *)(_octet);			\
	(_os).Length = (_len);

static enum rt_status PlatformIndicateBTEvent(
	struct rtw_adapter *padapter,
	void						*pEvntData,
	u32						dataLen
	)
{
	enum rt_status	rt_status = RT_STATUS_FAILURE;

	RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL, ("BT event start, %d bytes data to Transferred!!\n", dataLen));
	RTPRINT_DATA(FIOCTL, IOCTL_BT_EVENT_DETAIL, "To transfer Hex Data :\n",
		pEvntData, dataLen);

	BT_EventParse(padapter, pEvntData, dataLen);

	printk(KERN_WARNING "%s: Linux has no way to report BT event!!\n", __func__);

	RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL, ("BT event end, %s\n",
		(rt_status == RT_STATUS_SUCCESS) ? "SUCCESS" : "FAIL"));

	return rt_status;
}

/*  ===== Below this line is sync from SD7 driver COMMOM/bt_hci.c ===== */

static u8 bthci_GetLocalChannel(struct rtw_adapter *padapter)
{
	return padapter->mlmeextpriv.cur_channel;
}

static u8 bthci_GetCurrentEntryNum(struct rtw_adapter *padapter, u8 PhyHandle)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	u8 i;

	for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++) {
		if ((pBTInfo->BtAsocEntry[i].bUsed) &&
		    (pBTInfo->BtAsocEntry[i].PhyLinkCmdData.BtPhyLinkhandle == PhyHandle))
			return i;
	}

	return 0xFF;
}

static void bthci_DecideBTChannel(struct rtw_adapter *padapter, u8 EntryNum)
{
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct mlme_priv *pmlmepriv;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_hci_info *pBtHciInfo;
	struct chnl_txpower_triple *pTriple_subband = NULL;
	struct common_triple *pTriple;
	u8 i, j, localchnl, firstRemoteLegalChnlInTriplet = 0;
	u8 regulatory_skipLen = 0;
	u8 subbandTripletCnt = 0;

