torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	return true;
}

static u8 bthci_AddEntry(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	u8 i;

	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;

	for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++) {
		if (pBTInfo->BtAsocEntry[i].bUsed == false) {
			pBTInfo->BtAsocEntry[i].bUsed = true;
			pBtMgnt->CurrentConnectEntryNum = i;
			break;
		}
	}

	if (i == MAX_BT_ASOC_ENTRY_NUM) {
		RTPRINT(FIOCTL, IOCTL_STATE, ("bthci_AddEntry(), Add entry fail!!\n"));
		return false;
	}
	return true;
}

static u8 bthci_DiscardTxPackets(struct rtw_adapter *padapter, u16 LLH)
{
	return false;
}

static u8
bthci_CheckLogLinkBehavior(
	struct rtw_adapter *padapter,
	struct hci_flow_spec			TxFlowSpec
	)
{
	u8 ID = TxFlowSpec.Identifier;
	u8 ServiceType = TxFlowSpec.ServiceType;
	u16	MaxSDUSize = TxFlowSpec.MaximumSDUSize;
	u32	SDUInterArrivatime = TxFlowSpec.SDUInterArrivalTime;
	u8 match = false;

	switch (ID) {
	case 1:
		if (ServiceType == BT_LL_BE) {
			match = true;
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX best effort flowspec\n"));
		} else if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 0xffff)) {
			match = true;
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  RX guaranteed latency flowspec\n"));
		} else if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 2500)) {
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  RX guaranteed Large latency flowspec\n"));
		}
		break;
	case 2:
		if (ServiceType == BT_LL_BE) {
			match = true;
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  RX best effort flowspec\n"));

		}
		break;
	case 3:
		if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 1492)) {
			match = true;
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX guaranteed latency flowspec\n"));
		} else if ((ServiceType == BT_LL_GU) && (MaxSDUSize == 2500)) {
			RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX guaranteed Large latency flowspec\n"));
		}
		break;
	case 4:
		if (ServiceType == BT_LL_BE) {
			if ((SDUInterArrivatime == 0xffffffff) && (ServiceType == BT_LL_BE) && (MaxSDUSize == 1492)) {
				match = true;
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX/RX aggregated best effort flowspec\n"));
			}
		} else if (ServiceType == BT_LL_GU) {
			if (SDUInterArrivatime == 100) {
				match = true;
				RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  TX/RX guaranteed bandwidth flowspec\n"));
			}
		}
		break;
	default:
		RTPRINT(FIOCTL, (IOCTL_BT_EVENT|IOCTL_BT_LOGO), ("Logical Link Type =  Unknow Type !!!!!!!!\n"));
		break;
	}

	RTPRINT(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_LOGO),
		("ID = 0x%x, ServiceType = 0x%x, MaximumSDUSize = 0x%x, SDUInterArrivalTime = 0x%x, AccessLatency = 0x%x, FlushTimeout = 0x%x\n",
		TxFlowSpec.Identifier, TxFlowSpec.ServiceType, MaxSDUSize,
		SDUInterArrivatime, TxFlowSpec.AccessLatency, TxFlowSpec.FlushTimeout));
	return match;
}

static u16 bthci_AssocMACAddr(struct rtw_adapter *padapter, void	*pbuf)
{
	struct amp_assoc_structure *pAssoStrc = (struct amp_assoc_structure *)pbuf;
	pAssoStrc->TypeID = AMP_MAC_ADDR;
	pAssoStrc->Length = 0x06;
	memcpy(&pAssoStrc->Data[0], padapter->eeprompriv.mac_addr, 6);
	RTPRINT_DATA(FIOCTL, (IOCTL_BT_HCICMD|IOCTL_BT_HCICMD_DETAIL|IOCTL_BT_LOGO),
		     ("AssocMACAddr : \n"), pAssoStrc, pAssoStrc->Length+3);

	return pAssoStrc->Length + 3;
}

static u16
bthci_PALCapabilities(
	struct rtw_adapter *padapter,
	void	*pbuf
	)
{
	struct amp_assoc_structure *pAssoStrc = (struct amp_assoc_structure *)pbuf;

	pAssoStrc->TypeID = AMP_80211_PAL_CAP_LIST;
	pAssoStrc->Length = 0x04;

	pAssoStrc->Data[0] = 0x00;
	pAssoStrc->Data[1] = 0x00;

	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_DETAIL, ("PALCapabilities:\n"), pAssoStrc, pAssoStrc->Length+3);
	RTPRINT(FIOCTL, IOCTL_BT_LOGO, ("PALCapabilities \n"));

	RTPRINT(FIOCTL, IOCTL_BT_LOGO, (" TypeID = 0x%x,\n Length = 0x%x,\n Content = 0x0000\n",
		pAssoStrc->TypeID,
		pAssoStrc->Length));

	return pAssoStrc->Length + 3;
}

static u16 bthci_AssocPreferredChannelList(struct rtw_adapter *padapter,
					   void *pbuf, u8 EntryNum)
{
	struct bt_30info *pBTInfo;
	struct amp_assoc_structure *pAssoStrc;
	struct amp_pref_chnl_regulatory *pReg;
	struct chnl_txpower_triple *pTriple;
	char ctrString[3] = {'X', 'X', 'X'};
	u32 len = 0;
	u8 preferredChnl;

	pBTInfo = GET_BT_INFO(padapter);
	pAssoStrc = (struct amp_assoc_structure *)pbuf;
	pReg = (struct amp_pref_chnl_regulatory *)&pAssoStrc->Data[3];

	preferredChnl = bthci_GetLocalChannel(padapter);
	pAssoStrc->TypeID = AMP_PREFERRED_CHANNEL_LIST;

	/*  locale unknown */
	memcpy(&pAssoStrc->Data[0], &ctrString[0], 3);
	pReg->reXId = 201;
	pReg->regulatoryClass = 254;
	pReg->coverageClass = 0;
	len += 6;
	RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("PREFERRED_CHNL_LIST\n"));
	RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("XXX, 201, 254, 0\n"));
	/*  at the following, chnl 1~11 should be contained */
	pTriple = (struct chnl_txpower_triple *)&pAssoStrc->Data[len];

	/*  (1) if any wifi or bt HS connection exists */
	if ((pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_CREATOR) ||
	    (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE |
			   WIFI_ADHOC_STATE | WIFI_ADHOC_MASTER_STATE |
			   WIFI_AP_STATE)) ||
	    BTHCI_HsConnectionEstablished(padapter)) {
		pTriple->FirstChnl = preferredChnl;
		pTriple->NumChnls = 1;
		pTriple->MaxTxPowerInDbm = 20;
		len += 3;
		RTPRINT(FIOCTL, (IOCTL_BT_HCICMD | IOCTL_BT_LOGO), ("First Channel = %d, Channel Num = %d, MaxDbm = %d\n",
			pTriple->FirstChnl,
			pTriple->NumChnls,
			pTriple->MaxTxPowerInDbm));
	}

	pAssoStrc->Length = (u16)len;
	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD, ("AssocPreferredChannelList : \n"), pAssoStrc, pAssoStrc->Length+3);

	return pAssoStrc->Length + 3;
}

static u16 bthci_AssocPALVer(struct rtw_adapter *padapter, void *pbuf)
{
	struct amp_assoc_structure *pAssoStrc = (struct amp_assoc_structure *)pbuf;
	u8 *pu1Tmp;
	u16	*pu2Tmp;

	pAssoStrc->TypeID = AMP_80211_PAL_VISION;
	pAssoStrc->Length = 0x5;
	pu1Tmp = &pAssoStrc->Data[0];
	*pu1Tmp = 0x1;	/*  PAL Version */
	pu2Tmp = (u16 *)&pAssoStrc->Data[1];
	*pu2Tmp = 0x5D;	/*  SIG Company identifier of 802.11 PAL vendor */
	pu2Tmp = (u16 *)&pAssoStrc->Data[3];
	*pu2Tmp = 0x1;	/*  PAL Sub-version specifier */

	RTPRINT_DATA(FIOCTL, IOCTL_BT_HCICMD_DETAIL, ("AssocPALVer : \n"), pAssoStrc, pAssoStrc->Length+3);
	RTPRINT(FIOCTL, IOCTL_BT_LOGO, ("AssocPALVer \n"));

	RTPRINT(FIOCTL, IOCTL_BT_LOGO, (" TypeID = 0x%x,\n Length = 0x%x,\n PAL Version = 0x01,\n PAL vendor = 0x01,\n PAL Sub-version specifier = 0x01\n",
		pAssoStrc->TypeID,
		pAssoStrc->Length));
	return pAssoStrc->Length + 3;
}

static u8 bthci_CheckRfStateBeforeConnect(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo;
	enum rt_rf_power_state		RfState;

	pBTInfo = GET_BT_INFO(padapter);

