torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	if (EntryNum == 0xff) {
		/*  connection not started yet, just use the input physical link handle to response. */
		PL_handle = PLHandle;
	} else {
		/*  connection is under progress, use the phy link handle we recorded. */
		PL_handle  = pBTInfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtPhyLinkhandle;
		pBTInfo->BtAsocEntry[EntryNum].bNeedPhysLinkCompleteEvent = false;
	}

	RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("[BT event], Physical Link Complete, Status = 0x%x PhyLinkHandle = 0x%x\n", HciStatus,
		PL_handle));

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);
	PPacketIrpEvent->EventCode = HCI_EVENT_PHY_LINK_COMPLETE;
	PPacketIrpEvent->Length = 2;

	PPacketIrpEvent->Data[0] = HciStatus;
	PPacketIrpEvent->Data[1] = PL_handle;
	bthci_IndicateEvent(padapter, PPacketIrpEvent, 4);

}

static void
bthci_EventCommandStatus(
	struct rtw_adapter *padapter,
	u8 		OGF,
	u16					OCF,
	enum hci_status				HciStatus
	)
{

	u8 localBuf[6] = "";
	struct packet_irp_hcievent_data *PPacketIrpEvent;
	u8 Num_Hci_Comm = 0x1;
	RTPRINT(FIOCTL, IOCTL_BT_EVENT,
		("[BT event], CommandStatus, Opcode = 0x%02x%02x, OGF = 0x%x,  OCF = 0x%x, Status = 0x%x, Num_HCI_COMM = 0x%x\n",
		(HCIOPCODEHIGHT(OCF, OGF)), (HCIOPCODELOW(OCF, OGF)), OGF, OCF, HciStatus, Num_Hci_Comm));

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);
	PPacketIrpEvent->EventCode = HCI_EVENT_COMMAND_STATUS;
	PPacketIrpEvent->Length = 4;
	PPacketIrpEvent->Data[0] = HciStatus;	/* current pending */
	PPacketIrpEvent->Data[1] = Num_Hci_Comm;	/* packet # */
	PPacketIrpEvent->Data[2] = HCIOPCODELOW(OCF, OGF);
	PPacketIrpEvent->Data[3] = HCIOPCODEHIGHT(OCF, OGF);

	bthci_IndicateEvent(padapter, PPacketIrpEvent, 6);

}

static void
bthci_EventLogicalLinkComplete(
	struct rtw_adapter *padapter,
	enum hci_status				HciStatus,
	u8 		PhyLinkHandle,
	u16					LogLinkHandle,
	u8 		LogLinkIndex,
	u8 		EntryNum
	)
{
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_hci_info *pBtHciInfo = &pBTInfo->BtHciInfo;
	u8 localBuf[7] = "";
	struct packet_irp_hcievent_data *PPacketIrpEvent;

	if (!(pBtHciInfo->BTEventMaskPage2 & EMP2_HCI_EVENT_LOGICAL_LINK_COMPLETE)) {
		RTPRINT(FIOCTL, IOCTL_BT_EVENT,
			("[BT event], Logical Link Complete, Ignore to send this event due to event mask page 2\n"));
		return;
	}
	RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("[BT event], Logical Link Complete, PhyLinkHandle = 0x%x,  LogLinkHandle = 0x%x, Status = 0x%x\n",
		PhyLinkHandle, LogLinkHandle, HciStatus));

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);
	PPacketIrpEvent->EventCode = HCI_EVENT_LOGICAL_LINK_COMPLETE;
	PPacketIrpEvent->Length = 5;

	PPacketIrpEvent->Data[0] = HciStatus;/* status code */
	/* Logical link handle */
	PPacketIrpEvent->Data[1] = TWOBYTE_LOWBYTE(LogLinkHandle);
	PPacketIrpEvent->Data[2] = TWOBYTE_HIGHTBYTE(LogLinkHandle);
	/* Physical link handle */
	PPacketIrpEvent->Data[3] = TWOBYTE_LOWBYTE(PhyLinkHandle);
	/* corresponding Tx flow spec ID */
	if (HciStatus == HCI_STATUS_SUCCESS) {
		PPacketIrpEvent->Data[4] =
			pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData[LogLinkIndex].Tx_Flow_Spec.Identifier;
	} else {
		PPacketIrpEvent->Data[4] = 0x0;
	}

	bthci_IndicateEvent(padapter, PPacketIrpEvent, 7);
}

static void
bthci_EventDisconnectLogicalLinkComplete(
	struct rtw_adapter *padapter,
	enum hci_status				HciStatus,
	u16					LogLinkHandle,
	enum hci_status				Reason
	)
{
	u8 localBuf[6] = "";
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_hci_info *pBtHciInfo = &pBTInfo->BtHciInfo;
	struct packet_irp_hcievent_data *PPacketIrpEvent;

	if (!(pBtHciInfo->BTEventMaskPage2 & EMP2_HCI_EVENT_DISCONNECT_LOGICAL_LINK_COMPLETE)) {
		RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("[BT event], Disconnect Logical Link Complete, Ignore to send this event due to event mask page 2\n"));
		return;
	}
	RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("[BT event], Disconnect Logical Link Complete, Status = 0x%x, LLH = 0x%x Reason = 0x%x\n", HciStatus, LogLinkHandle, Reason));

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);
	PPacketIrpEvent->EventCode = HCI_EVENT_DISCONNECT_LOGICAL_LINK_COMPLETE;
	PPacketIrpEvent->Length = 4;

	PPacketIrpEvent->Data[0] = HciStatus;
	/* Logical link handle */
	PPacketIrpEvent->Data[1] = TWOBYTE_LOWBYTE(LogLinkHandle);
	PPacketIrpEvent->Data[2] = TWOBYTE_HIGHTBYTE(LogLinkHandle);
	/* Disconnect reason */
	PPacketIrpEvent->Data[3] = Reason;

	bthci_IndicateEvent(padapter, PPacketIrpEvent, 6);
}

static void
bthci_EventFlushOccurred(
	struct rtw_adapter *padapter,
	u16					LogLinkHandle
	)
{
	u8 localBuf[4] = "";
	struct packet_irp_hcievent_data *PPacketIrpEvent;
	RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("bthci_EventFlushOccurred(), LLH = 0x%x\n", LogLinkHandle));

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);
	PPacketIrpEvent->EventCode = HCI_EVENT_FLUSH_OCCRUED;
	PPacketIrpEvent->Length = 2;
	/* Logical link handle */
	PPacketIrpEvent->Data[0] = TWOBYTE_LOWBYTE(LogLinkHandle);
	PPacketIrpEvent->Data[1] = TWOBYTE_HIGHTBYTE(LogLinkHandle);

	bthci_IndicateEvent(padapter, PPacketIrpEvent, 4);
}

static enum hci_status
bthci_BuildPhysicalLink(
	struct rtw_adapter *padapter,
	struct packet_irp_hcicmd_data *pHciCmd,
	u16	OCF
)
{
	enum hci_status		status = HCI_STATUS_SUCCESS;
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	u8 EntryNum, PLH;

	/* Send HCI Command status event to AMP. */
	bthci_EventCommandStatus(padapter,
			LINK_CONTROL_COMMANDS,
			OCF,
			HCI_STATUS_SUCCESS);

	PLH = *((u8 *)pHciCmd->Data);

	/*  Check if resource or bt connection is under progress, if yes, reject the link creation. */
	if (!bthci_AddEntry(padapter)) {
		status = HCI_STATUS_CONNECT_RJT_LIMIT_RESOURCE;
		bthci_EventPhysicalLinkComplete(padapter, status, INVALID_ENTRY_NUM, PLH);
		return status;
	}

	EntryNum = pBtMgnt->CurrentConnectEntryNum;
	pBTInfo->BtAsocEntry[EntryNum].PhyLinkCmdData.BtPhyLinkhandle = PLH;
	pBtMgnt->BtCurrentPhyLinkhandle = PLH;

