torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
}

static void
bthci_StartBeaconAndConnect(
	struct rtw_adapter *padapter,
	struct packet_irp_hcicmd_data *pHciCmd,
	u8 CurrentAssocNum
	)
{
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, ("StartBeaconAndConnect, CurrentAssocNum =%d, AMPRole =%d\n",
		CurrentAssocNum,
		pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole));

	if (!pBtMgnt->CheckChnlIsSuit) {
		bthci_EventPhysicalLinkComplete(padapter, HCI_STATUS_CONNECT_REJ_NOT_SUIT_CHNL_FOUND, CurrentAssocNum, INVALID_PL_HANDLE);
		bthci_RemoveEntryByEntryNum(padapter, CurrentAssocNum);
		return;
	}

	if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_CREATOR) {
		rsprintf((char *)pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsidBuf, 32, "AMP-%02x-%02x-%02x-%02x-%02x-%02x",
		padapter->eeprompriv.mac_addr[0],
		padapter->eeprompriv.mac_addr[1],
		padapter->eeprompriv.mac_addr[2],
		padapter->eeprompriv.mac_addr[3],
		padapter->eeprompriv.mac_addr[4],
		padapter->eeprompriv.mac_addr[5]);
	} else if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_JOINER) {
		rsprintf((char *)pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsidBuf, 32, "AMP-%02x-%02x-%02x-%02x-%02x-%02x",
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[0],
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[1],
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[2],
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[3],
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[4],
		pBTInfo->BtAsocEntry[CurrentAssocNum].BTRemoteMACAddr[5]);
	}

	FillOctetString(pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsid, pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsidBuf, 21);
	pBTInfo->BtAsocEntry[CurrentAssocNum].BTSsid.Length = 21;

	/* To avoid set the start ap or connect twice, or the original connection will be disconnected. */
	if (!pBtMgnt->bBTConnectInProgress) {
		pBtMgnt->bBTConnectInProgress = true;
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress ON!!\n"));
		BTHCI_SM_WITH_INFO(padapter, HCI_STATE_STARTING, STATE_CMD_MAC_START_COMPLETE, CurrentAssocNum);

		/*  20100325 Joseph: Check RF ON/OFF. */
		/*  If RF OFF, it reschedule connecting operation after 50ms. */
		if (!bthci_CheckRfStateBeforeConnect(padapter))
			return;

		if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_CREATOR) {
			/* These macros need braces */
			BTHCI_SM_WITH_INFO(padapter, HCI_STATE_CONNECTING, STATE_CMD_MAC_CONNECT_COMPLETE, CurrentAssocNum);
		} else if (pBTInfo->BtAsocEntry[CurrentAssocNum].AMPRole == AMP_BTAP_JOINER) {
			bthci_ResponderStartToScan(padapter);
		}
	}
	RT_PRINT_STR(_module_rtl871x_mlme_c_, _drv_notice_,
		     "StartBeaconAndConnect, SSID:\n",
		     pBTInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTSsid.Octet,
		     pBTInfo->BtAsocEntry[pBtMgnt->CurrentConnectEntryNum].BTSsid.Length);
}

static void bthci_ResetBtMgnt(struct bt_mgnt *pBtMgnt)
{
	pBtMgnt->BtOperationOn = false;
	pBtMgnt->bBTConnectInProgress = false;
	pBtMgnt->bLogLinkInProgress = false;
	pBtMgnt->bPhyLinkInProgress = false;
	pBtMgnt->bPhyLinkInProgressStartLL = false;
	pBtMgnt->DisconnectEntryNum = 0xff;
	pBtMgnt->bStartSendSupervisionPkt = false;
	pBtMgnt->JoinerNeedSendAuth = false;
	pBtMgnt->CurrentBTConnectionCnt = 0;
	pBtMgnt->BTCurrentConnectType = BT_DISCONNECT;
	pBtMgnt->BTReceiveConnectPkt = BT_DISCONNECT;
	pBtMgnt->BTAuthCount = 0;
	pBtMgnt->btLogoTest = 0;
}

static void bthci_ResetBtHciInfo(struct bt_hci_info *pBtHciInfo)
{
	pBtHciInfo->BTEventMask = 0;
	pBtHciInfo->BTEventMaskPage2 = 0;
	pBtHciInfo->ConnAcceptTimeout =  10000;
	pBtHciInfo->PageTimeout  =  0x30;
	pBtHciInfo->LocationDomainAware = 0x0;
	pBtHciInfo->LocationDomain = 0x5858;
	pBtHciInfo->LocationDomainOptions = 0x58;
	pBtHciInfo->LocationOptions = 0x0;
	pBtHciInfo->FlowControlMode = 0x1;	/*  0:Packet based data flow control mode(BR/EDR), 1: Data block based data flow control mode(AMP). */

	pBtHciInfo->enFlush_LLH = 0;
	pBtHciInfo->FLTO_LLH = 0;

	/* Test command only */
	pBtHciInfo->bTestIsEnd = true;
	pBtHciInfo->bInTestMode = false;
	pBtHciInfo->bTestNeedReport = false;
	pBtHciInfo->TestScenario = 0xff;
	pBtHciInfo->TestReportInterval = 0x01;
	pBtHciInfo->TestCtrType = 0x5d;
	pBtHciInfo->TestEventType = 0x00;
	pBtHciInfo->TestNumOfFrame = 0;
	pBtHciInfo->TestNumOfErrFrame = 0;
	pBtHciInfo->TestNumOfBits = 0;
	pBtHciInfo->TestNumOfErrBits = 0;
}

static void bthci_ResetBtSec(struct rtw_adapter *padapter, struct bt_security *pBtSec)
{
/*PMGNT_INFO	pMgntInfo = &padapter->MgntInfo; */

	/*  Set BT used HW or SW encrypt !! */
	if (GET_HAL_DATA(padapter)->bBTMode)
		pBtSec->bUsedHwEncrypt = true;
	else
		pBtSec->bUsedHwEncrypt = false;
	RT_TRACE(_module_rtl871x_security_c_, _drv_info_, ("%s: bUsedHwEncrypt =%d\n", __func__, pBtSec->bUsedHwEncrypt));

	pBtSec->RSNIE.Octet = pBtSec->RSNIEBuf;
}

static void bthci_ResetBtExtInfo(struct bt_mgnt *pBtMgnt)
{
	u8 i;

	for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++) {
		pBtMgnt->ExtConfig.linkInfo[i].ConnectHandle = 0;
		pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = 0;
		pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = 0;
		pBtMgnt->ExtConfig.linkInfo[i].BTProfile = BT_PROFILE_NONE;
		pBtMgnt->ExtConfig.linkInfo[i].BTCoreSpec = BT_SPEC_2_1_EDR;
		pBtMgnt->ExtConfig.linkInfo[i].BT_RSSI = 0;
		pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_NONE;
		pBtMgnt->ExtConfig.linkInfo[i].linkRole = BT_LINK_MASTER;
	}

	pBtMgnt->ExtConfig.CurrentConnectHandle = 0;
	pBtMgnt->ExtConfig.CurrentIncomingTrafficMode = 0;
	pBtMgnt->ExtConfig.CurrentOutgoingTrafficMode = 0;
	pBtMgnt->ExtConfig.MIN_BT_RSSI = 0;
	pBtMgnt->ExtConfig.NumberOfHandle = 0;
	pBtMgnt->ExtConfig.NumberOfSCO = 0;
	pBtMgnt->ExtConfig.CurrentBTStatus = 0;
	pBtMgnt->ExtConfig.HCIExtensionVer = 0;

	pBtMgnt->ExtConfig.bManualControl = false;
	pBtMgnt->ExtConfig.bBTBusy = false;
	pBtMgnt->ExtConfig.bBTA2DPBusy = false;
}

static enum hci_status bthci_CmdReset(struct rtw_adapter *_padapter, u8 bNeedSendEvent)
{
	enum hci_status status = HCI_STATUS_SUCCESS;
	struct rtw_adapter *padapter;
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_hci_info *pBtHciInfo;
	struct bt_security *pBtSec;
	struct bt_dgb *pBtDbg;
	u8 i;

