torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	case HCI_EXTENSION_VERSION_NOTIFY:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_EXTENSION_VERSION_NOTIFY\n"));
		status = bthci_CmdExtensionVersionNotify(padapter, pHciCmd);
		break;
	case HCI_LINK_STATUS_NOTIFY:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_LINK_STATUS_NOTIFY\n"));
		status = bthci_CmdLinkStatusNotify(padapter, pHciCmd);
		break;
	case HCI_BT_OPERATION_NOTIFY:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_BT_OPERATION_NOTIFY\n"));
		status = bthci_CmdBtOperationNotify(padapter, pHciCmd);
		break;
	case HCI_ENABLE_WIFI_SCAN_NOTIFY:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_ENABLE_WIFI_SCAN_NOTIFY\n"));
		status = bthci_CmdEnableWifiScanNotify(padapter, pHciCmd);
		break;

	/* The following is for IVT */
	case HCI_WIFI_CURRENT_CHANNEL:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_WIFI_CURRENT_CHANNEL\n"));
		status = bthci_CmdWIFICurrentChannel(padapter, pHciCmd);
		break;
	case HCI_WIFI_CURRENT_BANDWIDTH:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_WIFI_CURRENT_BANDWIDTH\n"));
		status = bthci_CmdWIFICurrentBandwidth(padapter, pHciCmd);
		break;
	case HCI_WIFI_CONNECTION_STATUS:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_WIFI_CONNECTION_STATUS\n"));
		status = bthci_CmdWIFIConnectionStatus(padapter, pHciCmd);
		break;

	default:
		RTPRINT(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCI_UNKNOWN_COMMAND\n"));
		status = bthci_UnknownCMD(padapter, pHciCmd);
		break;
	}
	return status;
}

static void
bthci_StateStarting(struct rtw_adapter *padapter,
		    enum hci_state_with_cmd StateCmd, u8 EntryNum)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Starting], "));
	switch (StateCmd) {
	case STATE_CMD_CONNECT_ACCEPT_TIMEOUT:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_CONNECT_ACCEPT_TIMEOUT\n"));
		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_CONNECT_ACCEPT_TIMEOUT;
		pBtMgnt->bNeedNotifyAMPNoCap = true;
		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	case STATE_CMD_DISCONNECT_PHY_LINK:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
		EntryNum);

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_UNKNOW_CONNECT_ID;

		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	case STATE_CMD_MAC_START_COMPLETE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_START_COMPLETE\n"));
		if (pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_CREATOR)
			bthci_EventChannelSelected(padapter, EntryNum);
		break;
	default:
		RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
		break;
	}
}

static void
bthci_StateConnecting(struct rtw_adapter *padapter,
		      enum hci_state_with_cmd StateCmd, u8 EntryNum)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Connecting], "));
	switch (StateCmd) {
	case STATE_CMD_CONNECT_ACCEPT_TIMEOUT:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_CONNECT_ACCEPT_TIMEOUT\n"));
		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_CONNECT_ACCEPT_TIMEOUT;
		pBtMgnt->bNeedNotifyAMPNoCap = true;
		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	case STATE_CMD_MAC_CONNECT_COMPLETE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_CONNECT_COMPLETE\n"));

		if (pBTInfo->BtAsocEntry[EntryNum].AMPRole == AMP_BTAP_JOINER) {
			RT_TRACE(_module_rtl871x_security_c_,
				 _drv_info_, ("StateConnecting \n"));
		}
		break;
	case STATE_CMD_DISCONNECT_PHY_LINK:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
		EntryNum);

		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_UNKNOW_CONNECT_ID;

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		BTHCI_DisconnectPeer(padapter, EntryNum);

		break;
	case STATE_CMD_MAC_CONNECT_CANCEL_INDICATE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_CONNECT_CANCEL_INDICATE\n"));
		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_CONTROLLER_BUSY;
		/*  Because this state cmd is caused by the BTHCI_EventAMPStatusChange(), */
		/*  we don't need to send event in the following BTHCI_DisconnectPeer() again. */
		pBtMgnt->bNeedNotifyAMPNoCap = false;
		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	default:
		RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
		break;
	}
}

static void
bthci_StateConnected(struct rtw_adapter *padapter,
		     enum hci_state_with_cmd StateCmd, u8 EntryNum)
{
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Connected], "));
	switch (StateCmd) {
	u8 i;
	u16 logicHandle = 0;
	case STATE_CMD_DISCONNECT_PHY_LINK:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

		/* When we are trying to disconnect the phy link, we should disconnect log link first, */
		for (i = 0; i < MAX_LOGICAL_LINK_NUM; i++) {
			if (pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData->BtLogLinkhandle != 0) {
				logicHandle = pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData->BtLogLinkhandle;

				bthci_EventDisconnectLogicalLinkComplete(padapter, HCI_STATUS_SUCCESS,
					logicHandle, pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason);

				pBTInfo->BtAsocEntry[EntryNum].LogLinkCmdData->BtLogLinkhandle = 0;
			}
		}

		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
		EntryNum);

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;

	case STATE_CMD_MAC_DISCONNECT_INDICATE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_DISCONNECT_INDICATE\n"));

		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		/*  TODO: Remote Host not local host */
		HCI_STATUS_CONNECT_TERMINATE_LOCAL_HOST,
		EntryNum);
		BTHCI_DisconnectPeer(padapter, EntryNum);

		break;
	case STATE_CMD_ENTER_STATE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_ENTER_STATE\n"));

		if (pBtMgnt->bBTConnectInProgress) {
			pBtMgnt->bBTConnectInProgress = false;
			RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress OFF!!\n"));
		}
		pBTInfo->BtAsocEntry[EntryNum].BtCurrentState = HCI_STATE_CONNECTED;
		pBTInfo->BtAsocEntry[EntryNum].b4waySuccess = true;
		pBtMgnt->bStartSendSupervisionPkt = true;

		/*  for rate adaptive */

		if (padapter->HalFunc.UpdateRAMaskHandler)
			padapter->HalFunc.UpdateRAMaskHandler(padapter, MAX_FW_SUPPORT_MACID_NUM-1-EntryNum, 0);

		rtw_hal_set_hwreg23a(padapter, HW_VAR_BASIC_RATE, padapter->mlmepriv.cur_network.network.SupportedRates);
		BTDM_SetFwChnlInfo(padapter, RT_MEDIA_CONNECT);
		break;
	default:
		RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
		break;
	}
}

static void
bthci_StateAuth(struct rtw_adapter *padapter, enum hci_state_with_cmd StateCmd,
		u8 EntryNum)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Authenticating], "));
	switch (StateCmd) {
	case STATE_CMD_CONNECT_ACCEPT_TIMEOUT:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_CONNECT_ACCEPT_TIMEOUT\n"));
		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_CONNECT_ACCEPT_TIMEOUT;
		pBtMgnt->bNeedNotifyAMPNoCap = true;
		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	case STATE_CMD_DISCONNECT_PHY_LINK:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));
		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
		EntryNum);

		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_UNKNOW_CONNECT_ID;

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	case STATE_CMD_4WAY_FAILED:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_4WAY_FAILED\n"));

		pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus = HCI_STATUS_AUTH_FAIL;
		pBtMgnt->bNeedNotifyAMPNoCap = true;

		BTHCI_DisconnectPeer(padapter, EntryNum);

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);
		break;
	case STATE_CMD_4WAY_SUCCESSED:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_4WAY_SUCCESSED\n"));

		bthci_EventPhysicalLinkComplete(padapter, HCI_STATUS_SUCCESS, EntryNum, INVALID_PL_HANDLE);

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		BTHCI_SM_WITH_INFO(padapter, HCI_STATE_CONNECTED, STATE_CMD_ENTER_STATE, EntryNum);
		break;
	default:
		RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
		break;
	}
}

static void
bthci_StateDisconnecting(struct rtw_adapter *padapter,
			 enum hci_state_with_cmd StateCmd, u8 EntryNum)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Disconnecting], "));
	switch (StateCmd) {
	case STATE_CMD_MAC_CONNECT_CANCEL_INDICATE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_MAC_CONNECT_CANCEL_INDICATE\n"));
		if (pBTInfo->BtAsocEntry[EntryNum].bNeedPhysLinkCompleteEvent) {
			bthci_EventPhysicalLinkComplete(padapter,
				pBTInfo->BtAsocEntry[EntryNum].PhysLinkCompleteStatus,
				EntryNum, INVALID_PL_HANDLE);
		}

		if (pBtMgnt->bBTConnectInProgress) {
			pBtMgnt->bBTConnectInProgress = false;
			RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress OFF!!\n"));
		}

