torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
		BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTED, STATE_CMD_ENTER_STATE, EntryNum);
		break;
	case STATE_CMD_DISCONNECT_PHY_LINK:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
		EntryNum);

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		BTHCI_DisconnectPeer(padapter, EntryNum);
		break;
	default:
		RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
		break;
	}
}

static void
bthci_StateDisconnected(struct rtw_adapter *padapter,
			enum hci_state_with_cmd StateCmd, u8 EntryNum)
{
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_hci_info *pBtHciInfo = &pBTInfo->BtHciInfo;
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_STATE, ("[BT state], [Disconnected], "));
	switch (StateCmd) {
	case STATE_CMD_CREATE_PHY_LINK:
	case STATE_CMD_ACCEPT_PHY_LINK:
		if (StateCmd == STATE_CMD_CREATE_PHY_LINK)
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_CREATE_PHY_LINK\n"));
		else
			RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_ACCEPT_PHY_LINK\n"));

		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT PS], Disable IPS and LPS\n"));
		ips_leave23a(padapter);
		LPS_Leave23a(padapter);

		pBtMgnt->bPhyLinkInProgress = true;
		pBtMgnt->BTCurrentConnectType = BT_DISCONNECT;
		pBtMgnt->CurrentBTConnectionCnt++;
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], CurrentBTConnectionCnt = %d\n",
			pBtMgnt->CurrentBTConnectionCnt));
		pBtMgnt->BtOperationOn = true;
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], Bt Operation ON!! CurrentConnectEntryNum = %d\n",
			pBtMgnt->CurrentConnectEntryNum));

		if (pBtMgnt->bBTConnectInProgress) {
			bthci_EventPhysicalLinkComplete(padapter, HCI_STATUS_CONTROLLER_BUSY, INVALID_ENTRY_NUM, pBtMgnt->BtCurrentPhyLinkhandle);
			bthci_RemoveEntryByEntryNum(padapter, EntryNum);
			return;
		}

		if (StateCmd == STATE_CMD_CREATE_PHY_LINK)
			pBTInfo->BtAsocEntry[EntryNum].AMPRole = AMP_BTAP_CREATOR;
		else
			pBTInfo->BtAsocEntry[EntryNum].AMPRole = AMP_BTAP_JOINER;

		/*  1. MAC not yet in selected channel */
		while (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE|WIFI_SITE_MONITOR)) {
			RTPRINT(FIOCTL, IOCTL_STATE, ("Scan/Roaming/Wifi Link is in Progress, wait 200 ms\n"));
			mdelay(200);
		}
		/*  2. MAC already in selected channel */
		RTPRINT(FIOCTL, IOCTL_STATE, ("Channel is Ready\n"));
		mod_timer(&pBTInfo->BTHCIJoinTimeoutTimer,
			  jiffies + msecs_to_jiffies(pBtHciInfo->ConnAcceptTimeout));

		pBTInfo->BtAsocEntry[EntryNum].bNeedPhysLinkCompleteEvent = true;
		break;
	case STATE_CMD_DISCONNECT_PHY_LINK:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_DISCONNECT_PHY_LINK\n"));

		del_timer_sync(&pBTInfo->BTHCIJoinTimeoutTimer);

		bthci_EventDisconnectPhyLinkComplete(padapter,
		HCI_STATUS_SUCCESS,
		pBTInfo->BtAsocEntry[EntryNum].PhyLinkDisconnectReason,
		EntryNum);

		if (pBTInfo->BtAsocEntry[EntryNum].bNeedPhysLinkCompleteEvent) {
			bthci_EventPhysicalLinkComplete(padapter,
				HCI_STATUS_UNKNOW_CONNECT_ID,
				EntryNum, INVALID_PL_HANDLE);
		}

		if (pBtMgnt->bBTConnectInProgress) {
			pBtMgnt->bBTConnectInProgress = false;
			RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress OFF!!\n"));
		}
		BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTED, STATE_CMD_ENTER_STATE, EntryNum);
		bthci_RemoveEntryByEntryNum(padapter, EntryNum);
		break;
	case STATE_CMD_ENTER_STATE:
		RTPRINT(FIOCTL, IOCTL_STATE, ("STATE_CMD_ENTER_STATE\n"));
		break;
	default:
		RTPRINT(FIOCTL, IOCTL_STATE, ("State command(%d) is Wrong !!!\n", StateCmd));
		break;
	}
}

void BTHCI_EventParse(struct rtw_adapter *padapter, void *pEvntData, u32 dataLen)
{
}

u8 BTHCI_HsConnectionEstablished(struct rtw_adapter *padapter)
{
	u8 bBtConnectionExist = false;
	struct bt_30info *pBtinfo = GET_BT_INFO(padapter);
	u8 i;

	for (i = 0; i < MAX_BT_ASOC_ENTRY_NUM; i++) {
		if (pBtinfo->BtAsocEntry[i].b4waySuccess) {
			bBtConnectionExist = true;
			break;
		}
	}

/*RTPRINT(FIOCTL, IOCTL_STATE, (" BTHCI_HsConnectionEstablished(), connection exist = %d\n", bBtConnectionExist)); */

	return bBtConnectionExist;
}

static u8
BTHCI_CheckProfileExist(struct rtw_adapter *padapter,
			enum bt_traffic_mode_profile Profile)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	u8 IsPRofile = false;
	u8 i = 0;

	for (i = 0; i < pBtMgnt->ExtConfig.NumberOfHandle; i++) {
		if (pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile == Profile) {
			IsPRofile = true;
			break;
		}
	}

	return IsPRofile;
}

void BTHCI_UpdateBTProfileRTKToMoto(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	u8 i = 0;

	pBtMgnt->ExtConfig.NumberOfSCO = 0;

	for (i = 0; i < pBtMgnt->ExtConfig.NumberOfHandle; i++) {
		pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = BT_PROFILE_NONE;

		if (pBtMgnt->ExtConfig.linkInfo[i].BTProfile == BT_PROFILE_SCO)
			pBtMgnt->ExtConfig.NumberOfSCO++;

		pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile = pBtMgnt->ExtConfig.linkInfo[i].BTProfile;
		switch (pBtMgnt->ExtConfig.linkInfo[i].TrafficProfile) {
		case BT_PROFILE_SCO:
			break;
		case BT_PROFILE_PAN:
			pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = BT_MOTOR_EXT_BE;
			pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = BT_MOTOR_EXT_BE;
			break;
		case BT_PROFILE_A2DP:
			pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = BT_MOTOR_EXT_GULB;
			pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = BT_MOTOR_EXT_GULB;
			break;
		case BT_PROFILE_HID:
			pBtMgnt->ExtConfig.linkInfo[i].IncomingTrafficMode = BT_MOTOR_EXT_GUL;
			pBtMgnt->ExtConfig.linkInfo[i].OutgoingTrafficMode = BT_MOTOR_EXT_BE;
			break;
		default:
			break;
		}
	}

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], RTK, NumberOfHandle = %d, NumberOfSCO = %d\n",
		pBtMgnt->ExtConfig.NumberOfHandle, pBtMgnt->ExtConfig.NumberOfSCO));
}

void BTHCI_WifiScanNotify(struct rtw_adapter *padapter, u8 scanType)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

