torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	if (pBtMgnt->ExtConfig.bEnableWifiScanNotify)
		bthci_EventExtWifiScanNotify(padapter, scanType);
}

void
BTHCI_StateMachine(
	struct rtw_adapter *padapter,
	u8 		StateToEnter,
	enum hci_state_with_cmd		StateCmd,
	u8 		EntryNum
	)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	if (EntryNum == 0xff) {
		RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, error EntryNum = 0x%x \n", EntryNum));
		return;
	}
	RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, EntryNum = 0x%x, CurrentState = 0x%x, BtNextState = 0x%x,  StateCmd = 0x%x , StateToEnter = 0x%x\n",
		EntryNum, pBTInfo->BtAsocEntry[EntryNum].BtCurrentState, pBTInfo->BtAsocEntry[EntryNum].BtNextState, StateCmd, StateToEnter));

	if (pBTInfo->BtAsocEntry[EntryNum].BtNextState & StateToEnter) {
		pBTInfo->BtAsocEntry[EntryNum].BtCurrentState = StateToEnter;

		switch (StateToEnter) {
		case HCI_STATE_STARTING:
			pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTING | HCI_STATE_CONNECTING;
			bthci_StateStarting(padapter, StateCmd, EntryNum);
			break;
		case HCI_STATE_CONNECTING:
			pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_CONNECTING | HCI_STATE_DISCONNECTING | HCI_STATE_AUTHENTICATING;
			bthci_StateConnecting(padapter, StateCmd, EntryNum);
			break;
		case HCI_STATE_AUTHENTICATING:
			pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTING | HCI_STATE_CONNECTED;
			bthci_StateAuth(padapter, StateCmd, EntryNum);
			break;
		case HCI_STATE_CONNECTED:
			pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_CONNECTED | HCI_STATE_DISCONNECTING;
			bthci_StateConnected(padapter, StateCmd, EntryNum);
			break;
		case HCI_STATE_DISCONNECTING:
			pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTED | HCI_STATE_DISCONNECTING;
			bthci_StateDisconnecting(padapter, StateCmd, EntryNum);
			break;
		case HCI_STATE_DISCONNECTED:
			pBTInfo->BtAsocEntry[EntryNum].BtNextState = HCI_STATE_DISCONNECTED | HCI_STATE_STARTING | HCI_STATE_CONNECTING;
			bthci_StateDisconnected(padapter, StateCmd, EntryNum);
			break;
		default:
			RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, Unknown state to enter!!!\n"));
			break;
		}
	} else {
		RTPRINT(FIOCTL, IOCTL_STATE, (" StateMachine, Wrong state to enter\n"));
	}

	/*  20100325 Joseph: Disable/Enable IPS/LPS according to BT status. */
	if (!pBtMgnt->bBTConnectInProgress && !pBtMgnt->BtOperationOn) {
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT PS], ips_enter23a()\n"));
		ips_enter23a(padapter);
	}
}

void BTHCI_DisconnectPeer(struct rtw_adapter *padapter, u8 EntryNum)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;

	RTPRINT(FIOCTL, IOCTL_BT_HCICMD, (" BTHCI_DisconnectPeer()\n"));

	BTHCI_SM_WITH_INFO(padapter, HCI_STATE_DISCONNECTING, STATE_CMD_MAC_CONNECT_CANCEL_INDICATE, EntryNum);

	if (pBTInfo->BtAsocEntry[EntryNum].bUsed) {
/*BTPKT_SendDeauthentication(padapter, pBTInfo->BtAsocEntry[EntryNum].BTRemoteMACAddr, unspec_reason); not porting yet */
	}

	if (pBtMgnt->bBTConnectInProgress) {
		pBtMgnt->bBTConnectInProgress = false;
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT Flag], BT Connect in progress OFF!!\n"));
	}

	bthci_RemoveEntryByEntryNum(padapter, EntryNum);

	if (pBtMgnt->bNeedNotifyAMPNoCap) {
		RTPRINT(FIOCTL, IOCTL_STATE, ("[BT AMPStatus], set to invalid in BTHCI_DisconnectPeer()\n"));
		BTHCI_EventAMPStatusChange(padapter, AMP_STATUS_NO_CAPACITY_FOR_BT);
	}
}

void BTHCI_EventNumOfCompletedDataBlocks(struct rtw_adapter *padapter)
{
/*PMGNT_INFO pMgntInfo = &padapter->MgntInfo; */
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_hci_info *pBtHciInfo = &pBTInfo->BtHciInfo;
	u8 localBuf[TmpLocalBufSize] = "";
	u8 *pRetPar, *pTriple;
	u8 len = 0, i, j, handleNum = 0;
	struct packet_irp_hcievent_data *PPacketIrpEvent;
	u16 *pu2Temp, *pPackets, *pHandle, *pDblocks;
	u8 sent = 0;

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);

	if (!(pBtHciInfo->BTEventMaskPage2 & EMP2_HCI_EVENT_NUM_OF_COMPLETE_DATA_BLOCKS)) {
		RTPRINT(FIOCTL, IOCTL_BT_EVENT, ("[BT event], Num Of Completed DataBlocks, Ignore to send NumOfCompletedDataBlocksEvent due to event mask page 2\n"));
		return;
	}

	/*  Return parameters starts from here */
	pRetPar = &PPacketIrpEvent->Data[0];
	pTriple = &pRetPar[3];
	for (j = 0; j < MAX_BT_ASOC_ENTRY_NUM; j++) {

		for (i = 0; i < MAX_LOGICAL_LINK_NUM; i++) {
			if (pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].BtLogLinkhandle) {
				handleNum++;
				pHandle = (u16 *)&pTriple[0];	/*  Handle[i] */
				pPackets = (u16 *)&pTriple[2];	/*  Num_Of_Completed_Packets[i] */
				pDblocks = (u16 *)&pTriple[4];	/*  Num_Of_Completed_Blocks[i] */
				*pHandle = pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].BtLogLinkhandle;
				*pPackets = (u16)pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount;
				*pDblocks = (u16)pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount;
				if (pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount) {
					sent = 1;
					RTPRINT(FIOCTL, IOCTL_BT_EVENT_DETAIL,
						("[BT event], Num Of Completed DataBlocks, Handle = 0x%x, Num_Of_Completed_Packets = 0x%x, Num_Of_Completed_Blocks = 0x%x\n",
					*pHandle, *pPackets, *pDblocks));
				}
				pBTInfo->BtAsocEntry[j].LogLinkCmdData[i].TxPacketCount = 0;
				len += 6;
				pTriple += len;
			}
		}
	}

	pRetPar[2] = handleNum;				/*  Number_of_Handles */
	len += 1;
	pu2Temp = (u16 *)&pRetPar[0];
	*pu2Temp = BTTotalDataBlockNum;
	len += 2;

	PPacketIrpEvent->EventCode = HCI_EVENT_NUM_OF_COMPLETE_DATA_BLOCKS;
	PPacketIrpEvent->Length = len;
	if (handleNum && sent)
		bthci_IndicateEvent(padapter, PPacketIrpEvent, len+2);
}

void BTHCI_EventAMPStatusChange(struct rtw_adapter *padapter, u8 AMP_Status)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	struct packet_irp_hcievent_data *PPacketIrpEvent;
	u8 len = 0;
	u8 localBuf[7] = "";
	u8 *pRetPar;

	if (AMP_Status == AMP_STATUS_NO_CAPACITY_FOR_BT) {
		pBtMgnt->BTNeedAMPStatusChg = true;
		pBtMgnt->bNeedNotifyAMPNoCap = false;

		BTHCI_DisconnectAll(padapter);
	} else if (AMP_Status == AMP_STATUS_FULL_CAPACITY_FOR_BT) {
		pBtMgnt->BTNeedAMPStatusChg = false;
	}

	PPacketIrpEvent = (struct packet_irp_hcievent_data *)(&localBuf[0]);
	/*  Return parameters starts from here */
	pRetPar = &PPacketIrpEvent->Data[0];

