torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
			}
			break;
		case 4:	/*  for wifi scan & BT is connected */
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  protect 3 beacons in 3-beacon period & no Tx pause at BT slot */
				BTDM_SetFw3a(padapter, 0x93, 0x15, 0x03, 0x14, 0x0);
			}
			break;
		case 5:	/*  for WiFi connected-busy & BT is Non-Connected-Idle */
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  SCO mode, Ant fixed at WiFi, WLAN_Act toggle */
				BTDM_SetFw3a(padapter, 0x61, 0x15, 0x03, 0x31, 0x00);
			}
			break;
		case 9:	/*  ACL high-retry type - 2 */
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  narrow duration for WiFi */
				BTDM_SetFw3a(padapter, 0xd3, 0xa, 0xa, 0x0, 0x58); /* narrow duration for WiFi */
			}
			break;
		case 10: /*  for WiFi connect idle & BT ACL busy or WiFi Connected-Busy & BT is Inquiry */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0x13, 0xa, 0xa, 0x0, 0x40);
			break;
		case 11: /*  ACL high-retry type - 3 */
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  narrow duration for WiFi */
				BTDM_SetFw3a(padapter, 0xd3, 0x05, 0x05, 0x00, 0x58);
			}
			break;
		case 12: /*  for WiFi Connected-Busy & BT is Connected-Idle */
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  Allow High-Pri BT */
				BTDM_SetFw3a(padapter, 0xeb, 0x0a, 0x03, 0x31, 0x18);
			}
			break;
		case 20: /*  WiFi only busy , TDMA mode for power saving */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0x13, 0x25, 0x25, 0x00, 0x00);
			break;
		case 27: /*  WiFi DHCP/Site Survey & BT SCO busy */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0xa3, 0x25, 0x03, 0x31, 0x98);
			break;
		case 28: /*  WiFi DHCP/Site Survey & BT idle */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0x69, 0x25, 0x03, 0x31, 0x00);
			break;
		case 29: /*  WiFi DHCP/Site Survey & BT ACL busy */
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				BTDM_SetFw3a(padapter, 0xeb, 0x1a, 0x1a, 0x01, 0x18);
				rtw_write32(padapter, 0x6c0, 0x5afa5afa);
				rtw_write32(padapter, 0x6c4, 0x5afa5afa);
			}
			break;
		case 30: /*  WiFi idle & BT Inquiry */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0x93, 0x15, 0x03, 0x14, 0x00);
			break;
		case 31:  /*  BT HID */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0xd3, 0x1a, 0x1a, 0x00, 0x58);
			break;
		case 32:  /*  BT SCO & Inquiry */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0xab, 0x0a, 0x03, 0x11, 0x98);
			break;
		case 33:  /*  BT SCO & WiFi site survey */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0xa3, 0x25, 0x03, 0x30, 0x98);
			break;
		case 34:  /*  BT HID & WiFi site survey */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0xd3, 0x1a, 0x1a, 0x00, 0x18);
			break;
		case 35:  /*  BT HID & WiFi Connecting */
			if (btdm_Is1AntPsTdmaStateChange(padapter))
				BTDM_SetFw3a(padapter, 0xe3, 0x1a, 0x1a, 0x00, 0x18);
			break;
		}
	} else {
		/*  disable PS-TDMA */
		switch (type) {
		case 8:
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  Antenna control by PTA, 0x870 = 0x310 */
				BTDM_SetFw3a(padapter, 0x8, 0x0, 0x0, 0x0, 0x0);
			}
			break;
		case 0:
		default:
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  Antenna control by PTA, 0x870 = 0x310 */
				BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0);
			}
			rtw_write16(padapter, 0x860, 0x210); /*  Switch Antenna to BT */
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 0x860 = 0x210, Switch Antenna to BT\n"));
			break;
		case 9:
			if (btdm_Is1AntPsTdmaStateChange(padapter)) {
				/*  Antenna control by PTA, 0x870 = 0x310 */
				BTDM_SetFw3a(padapter, 0x0, 0x0, 0x0, 0x8, 0x0);
			}
			rtw_write16(padapter, 0x860, 0x110); /*  Switch Antenna to WiFi */
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], 0x860 = 0x110, Switch Antenna to WiFi\n"));
			break;
		}
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Current TDMA(%s, %d)\n",
		pBtdm8723->bCurPsTdmaOn?"ON":"OFF", pBtdm8723->curPsTdma));

	/*  update pre state */
	pBtdm8723->bPrePsTdmaOn = pBtdm8723->bCurPsTdmaOn;
	pBtdm8723->prePsTdma = pBtdm8723->curPsTdma;
}

static void
_btdm_1AntSetPSTDMA(struct rtw_adapter *padapter, u8 bPSEn, u8 smartps,
		    u8 psOption, u8 bTDMAOn, u8 tdmaType)
{
	struct pwrctrl_priv *pwrctrl;
	struct hal_data_8723a *pHalData;
	struct btdm_8723a_1ant *pBtdm8723;
	u8 psMode;
	u8 bSwitchPS;

	if (!check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE) &&
	    (get_fwstate(&padapter->mlmepriv) != WIFI_NULL_STATE)) {
		btdm_1AntPsTdma(padapter, bTDMAOn, tdmaType);
		return;
	}
	psOption &= ~BIT(0);

	RTPRINT(FBT, BT_TRACE,
		("[BTCoex], Set LPS(%s, %d) TDMA(%s, %d)\n",
		bPSEn == true?"ON":"OFF", psOption,
		bTDMAOn == true?"ON":"OFF", tdmaType));

	pwrctrl = &padapter->pwrctrlpriv;
	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	if (bPSEn) {
		if (pBtdm8723->bWiFiHalt) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Enable PS Fail, WiFi in Halt!!\n"));
			return;
		}

		if (pwrctrl->bInSuspend) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Enable PS Fail, WiFi in Suspend!!\n"));
			return;
		}

		if (padapter->bDriverStopped) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Enable PS Fail, WiFi driver stopped!!\n"));
			return;
		}

		if (padapter->bSurpriseRemoved) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Enable PS Fail, WiFi Surprise Removed!!\n"));
			return;
		}

		psMode = PS_MODE_MIN;
	} else {
		psMode = PS_MODE_ACTIVE;
		psOption = 0;
	}

	if (psMode != pwrctrl->pwr_mode) {
		bSwitchPS = true;
	} else if (psMode != PS_MODE_ACTIVE) {
		if (psOption != pwrctrl->bcn_ant_mode)
			bSwitchPS = true;
		else if (smartps != pwrctrl->smart_ps)
			bSwitchPS = true;
		else
			bSwitchPS = false;
	} else {
		bSwitchPS = false;
	}

	if (bSwitchPS) {
		/*  disable TDMA */
		if (pBtdm8723->bCurPsTdmaOn) {
			if (!bTDMAOn) {
				btdm_1AntPsTdma(padapter, false, tdmaType);
			} else {
				if ((BT_IsBtDisabled(padapter)) ||
				    (pHalData->bt_coexist.halCoex8723.c2hBtInfo == BT_INFO_STATE_NO_CONNECTION) ||
				    (pHalData->bt_coexist.halCoex8723.c2hBtInfo == BT_INFO_STATE_CONNECT_IDLE) ||
				    (tdmaType == 29))
					btdm_1AntPsTdma(padapter, false, 9);
				else
					btdm_1AntPsTdma(padapter, false, 0);
			}
		}

