torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
		/*  change Power Save State */
		btdm_1AntSetPSMode(padapter, bPSEn, smartps, psOption);
	}

	btdm_1AntPsTdma(padapter, bTDMAOn, tdmaType);
}

static void
btdm_1AntSetPSTDMA(struct rtw_adapter *padapter, u8 bPSEn,
		   u8 psOption, u8 bTDMAOn, u8 tdmaType)
{
	_btdm_1AntSetPSTDMA(padapter, bPSEn, 0, psOption, bTDMAOn, tdmaType);
}

static void btdm_1AntWifiParaAdjust(struct rtw_adapter *padapter, u8 bEnable)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct btdm_8723a_1ant *pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	if (bEnable) {
		pBtdm8723->curWifiPara = 1;
		if (pBtdm8723->preWifiPara != pBtdm8723->curWifiPara)
			BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_LOW_PENALTY);
	} else {
		pBtdm8723->curWifiPara = 2;
		if (pBtdm8723->preWifiPara != pBtdm8723->curWifiPara)
			BTDM_SetSwPenaltyTxRateAdaptive(padapter, BT_TX_RATE_ADAPTIVE_NORMAL);
	}

}

static void btdm_1AntPtaParaReload(struct rtw_adapter *padapter)
{
	/*  PTA parameter */
	rtw_write8(padapter, 0x6cc, 0x0);			/*  1-Ant coex */
	rtw_write32(padapter, 0x6c8, 0xffff);		/*  wifi break table */
	rtw_write32(padapter, 0x6c4, 0x55555555);	/*  coex table */

	/*  Antenna switch control parameter */
	rtw_write32(padapter, 0x858, 0xaaaaaaaa);
	if (IS_8723A_A_CUT(GET_HAL_DATA(padapter)->VersionID)) {
		rtw_write32(padapter, 0x870, 0x0);	/*  SPDT(connected with TRSW) control by hardware PTA */
		rtw_write8(padapter, 0x40, 0x24);
	} else {
		rtw_write8(padapter, 0x40, 0x20);
		rtw_write16(padapter, 0x860, 0x210);	/*  set antenna at bt side if ANTSW is software control */
		rtw_write32(padapter, 0x870, 0x300);	/*  SPDT(connected with TRSW) control by hardware PTA */
		rtw_write32(padapter, 0x874, 0x22804000);	/*  ANTSW keep by GNT_BT */
	}

	/*  coexistence parameters */
	rtw_write8(padapter, 0x778, 0x1);	/*  enable RTK mode PTA */

	/*  BT don't ignore WLAN_Act */
	btdm_SetFwIgnoreWlanAct(padapter, false);
}

/*
 * Return
 *1: upgrade (add WiFi duration time)
 *0: keep
 *-1: downgrade (add BT duration time)
 */
static s8 btdm_1AntTdmaJudgement(struct rtw_adapter *padapter, u8 retry)
{
	struct hal_data_8723a *pHalData;
	struct btdm_8723a_1ant *pBtdm8723;
	static s8 up, dn, m = 1, n = 3, WaitCount;
	s8 ret;

	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;
	ret = 0;

	if (pBtdm8723->psTdmaMonitorCnt == 0) {
		up = 0;
		dn = 0;
		m = 1;
		n = 3;
		WaitCount = 0;
	} else {
		WaitCount++;
	}

	if (retry == 0) {
	/*  no retry in the last 2-second duration */
		up++;
		dn--;
		if (dn < 0)
			dn = 0;
		if (up >= 3*m) {
			/*  retry = 0 in consecutive 3m*(2s), add WiFi duration */
			ret = 1;

			n = 3;
			up = 0;
			dn = 0;
			WaitCount = 0;
		}
	} else if (retry <= 3) {
		/*  retry<= 3 in the last 2-second duration */
		up--;
		dn++;
		if (up < 0)
			up = 0;

		if (dn == 2) {
			/*  retry<= 3 in consecutive 2*(2s), minus WiFi duration (add BT duration) */
			ret = -1;

			/*  record how many time downgrad WiFi duration */
			if (WaitCount <= 2)
				m++;
			else
				m = 1;
			/*  the max number of m is 20 */
			/*  the longest time of upgrade WiFi duration is 20*3*2s = 120s */
			if (m >= 20)
				m = 20;
			up = 0;
			dn = 0;
			WaitCount = 0;
		}
	} else {
		/*  retry count > 3 */
		/*  retry>3, minus WiFi duration (add BT duration) */
		ret = -1;

		/*  record how many time downgrad WiFi duration */
		if (WaitCount == 1)
			m++;
		else
			m = 1;
		if (m >= 20)
			m = 20;

		up = 0;
		dn = 0;
		WaitCount = 0;
	}
	return ret;
}

static void btdm_1AntTdmaDurationAdjustForACL(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct btdm_8723a_1ant *pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;

	if (pBtdm8723->psTdmaGlobalCnt != pBtdm8723->psTdmaMonitorCnt) {
		pBtdm8723->psTdmaMonitorCnt = 0;
		pBtdm8723->psTdmaGlobalCnt = 0;
	}
	if (pBtdm8723->psTdmaMonitorCnt == 0) {
		btdm_1AntSetPSTDMA(padapter, true, 0, true, 2);
		pBtdm8723->psTdmaDuAdjType = 2;
	} else {
		/*  Now we only have 4 level Ps Tdma, */
		/*  if that's not the following 4 level(will changed by wifi scan, dhcp...), */
		/*  then we have to adjust it back to the previous record one. */
		if ((pBtdm8723->curPsTdma != 1) &&
		    (pBtdm8723->curPsTdma != 2) &&
		    (pBtdm8723->curPsTdma != 9) &&
		    (pBtdm8723->curPsTdma != 11)) {
			btdm_1AntSetPSTDMA(padapter, true, 0, true, pBtdm8723->psTdmaDuAdjType);
		} else {
			s32 judge = 0;

			judge = btdm_1AntTdmaJudgement(padapter, pHalData->bt_coexist.halCoex8723.btRetryCnt);
			if (judge == -1) {
				if (pBtdm8723->curPsTdma == 1) {
					/*  Decrease WiFi duration for high BT retry */
					if (pHalData->bt_coexist.halCoex8723.btInfoExt)
						pBtdm8723->psTdmaDuAdjType = 9;
					else
						pBtdm8723->psTdmaDuAdjType = 2;
					btdm_1AntSetPSTDMA(padapter, true, 0, true, pBtdm8723->psTdmaDuAdjType);
				} else if (pBtdm8723->curPsTdma == 2) {
					btdm_1AntSetPSTDMA(padapter, true, 0, true, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				} else if (pBtdm8723->curPsTdma == 9) {
					btdm_1AntSetPSTDMA(padapter, true, 0, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				}
			} else if (judge == 1) {
				if (pBtdm8723->curPsTdma == 11) {
					btdm_1AntSetPSTDMA(padapter, true, 0, true, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				} else if (pBtdm8723->curPsTdma == 9) {
					if (pHalData->bt_coexist.halCoex8723.btInfoExt)
						pBtdm8723->psTdmaDuAdjType = 9;
					else
						pBtdm8723->psTdmaDuAdjType = 2;
					btdm_1AntSetPSTDMA(padapter, true, 0, true, pBtdm8723->psTdmaDuAdjType);
				} else if (pBtdm8723->curPsTdma == 2) {
					if (pHalData->bt_coexist.halCoex8723.btInfoExt)
						pBtdm8723->psTdmaDuAdjType = 9;
					else
						pBtdm8723->psTdmaDuAdjType = 1;
					btdm_1AntSetPSTDMA(padapter, true, 0, true, pBtdm8723->psTdmaDuAdjType);
				}
			}
		}
		RTPRINT(FBT, BT_TRACE,
			("[BTCoex], ACL current TDMA(%s, %d)\n",
			(pBtdm8723->bCurPsTdmaOn ? "ON" : "OFF"), pBtdm8723->curPsTdma));
	}
	pBtdm8723->psTdmaMonitorCnt++;
}

static void btdm_1AntCoexProcessForWifiConnect(struct rtw_adapter *padapter)
{
	struct mlme_priv *pmlmepriv;
	struct hal_data_8723a *pHalData;
	struct bt_coexist_8723a *pBtCoex;
	struct btdm_8723a_1ant *pBtdm8723;
	u8 BtState;

