torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	pmlmepriv = &padapter->mlmepriv;
	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex->btdm1Ant;
	BtState = pBtCoex->c2hBtInfo;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], WiFi is %s\n", BTDM_IsWifiBusy(padapter)?"Busy":"IDLE"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is %s\n", BtStateString[BtState]));

	padapter->pwrctrlpriv.btcoex_rfon = false;

	if ((!BTDM_IsWifiBusy(padapter)) && (!check_fwstate(&padapter->mlmepriv, WIFI_AP_STATE)) &&
	    ((BtState == BT_INFO_STATE_NO_CONNECTION) || (BtState == BT_INFO_STATE_CONNECT_IDLE))) {
		switch (BtState) {
		case BT_INFO_STATE_NO_CONNECTION:
			_btdm_1AntSetPSTDMA(padapter, true, 2, 0x26, false, 9);
			break;
		case BT_INFO_STATE_CONNECT_IDLE:
			_btdm_1AntSetPSTDMA(padapter, true, 2, 0x26, false, 0);
			break;
		}
	} else {
		switch (BtState) {
		case BT_INFO_STATE_NO_CONNECTION:
		case BT_INFO_STATE_CONNECT_IDLE:
			/*  WiFi is Busy */
			btdm_1AntSetPSTDMA(padapter, false, 0, true, 5);
			rtw_write32(padapter, 0x6c0, 0x5a5a5a5a);
			rtw_write32(padapter, 0x6c4, 0x5a5a5a5a);
			break;
		case BT_INFO_STATE_ACL_INQ_OR_PAG:
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is BT_INFO_STATE_ACL_INQ_OR_PAG\n"));
		case BT_INFO_STATE_INQ_OR_PAG:
			padapter->pwrctrlpriv.btcoex_rfon = true;
			btdm_1AntSetPSTDMA(padapter, true, 0, true, 30);
			break;
		case BT_INFO_STATE_SCO_ONLY_BUSY:
		case BT_INFO_STATE_ACL_SCO_BUSY:
			if (true == pBtCoex->bC2hBtInquiryPage) {
				btdm_1AntSetPSTDMA(padapter, false, 0, true, 32);
			} else {
#ifdef BTCOEX_CMCC_TEST
				btdm_1AntSetPSTDMA(padapter, false, 0, true, 23);
#else /*  !BTCOEX_CMCC_TEST */
				btdm_1AntSetPSTDMA(padapter, false, 0, false, 8);
				rtw_write32(padapter, 0x6c0, 0x5a5a5a5a);
				rtw_write32(padapter, 0x6c4, 0x5a5a5a5a);
#endif /*  !BTCOEX_CMCC_TEST */
			}
			break;
		case BT_INFO_STATE_ACL_ONLY_BUSY:
			padapter->pwrctrlpriv.btcoex_rfon = true;
			if (pBtCoex->c2hBtProfile == BT_INFO_HID) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is HID\n"));
				btdm_1AntSetPSTDMA(padapter, true, 0, true, 31);
			} else if (pBtCoex->c2hBtProfile == BT_INFO_FTP) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is FTP/OPP\n"));
				btdm_1AntSetPSTDMA(padapter, true, 0, true, 3);
			} else if (pBtCoex->c2hBtProfile == (BT_INFO_A2DP|BT_INFO_FTP)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is A2DP_FTP\n"));
				btdm_1AntSetPSTDMA(padapter, true, 0, true, 11);
			} else {
				if (pBtCoex->c2hBtProfile == BT_INFO_A2DP)
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is A2DP\n"));
				else
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT PROFILE is UNKNOWN(0x%02X)! Use A2DP Profile\n", pBtCoex->c2hBtProfile));
				btdm_1AntTdmaDurationAdjustForACL(padapter);
			}
			break;
		}
	}

	pBtdm8723->psTdmaGlobalCnt++;
}

static void btdm_1AntUpdateHalRAMask(struct rtw_adapter *padapter, u32 mac_id, u32 filter)
{
	u8 init_rate = 0;
	u8 raid;
	u32 mask;
	u8 shortGIrate = false;
	int	supportRateNum = 0;
	struct sta_info	*psta;
	struct hal_data_8723a *pHalData;
	struct dm_priv *pdmpriv;
	struct mlme_ext_priv *pmlmeext;
	struct mlme_ext_info *pmlmeinfo;
	struct wlan_bssid_ex *cur_network;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s, MACID =%d, filter = 0x%08x!!\n", __func__, mac_id, filter));

	pHalData = GET_HAL_DATA(padapter);
	pdmpriv = &pHalData->dmpriv;
	pmlmeext = &padapter->mlmeextpriv;
	pmlmeinfo = &pmlmeext->mlmext_info;
	cur_network = &pmlmeinfo->network;

	if (mac_id >= NUM_STA) { /* CAM_SIZE */
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s, MACID =%d illegal!!\n", __func__, mac_id));
		return;
	}

	psta = pmlmeinfo->FW_sta_info[mac_id].psta;
	if (psta == NULL) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], %s, Can't find station!!\n", __func__));
		return;
	}

	raid = psta->raid;

	switch (mac_id) {
	case 0:/*  for infra mode */
		supportRateNum = rtw_get_rateset_len23a(cur_network->SupportedRates);
		mask = update_supported_rate23a(cur_network->SupportedRates, supportRateNum);
		mask |= (pmlmeinfo->HT_enable) ? update_MSC_rate23a(&pmlmeinfo->HT_caps):0;
		if (support_short_GI23a(padapter, &pmlmeinfo->HT_caps))
			shortGIrate = true;
		break;
	case 1:/* for broadcast/multicast */
		supportRateNum = rtw_get_rateset_len23a(pmlmeinfo->FW_sta_info[mac_id].SupportedRates);
		mask = update_basic_rate23a(cur_network->SupportedRates, supportRateNum);
		break;
	default: /* for each sta in IBSS */
		supportRateNum = rtw_get_rateset_len23a(pmlmeinfo->FW_sta_info[mac_id].SupportedRates);
		mask = update_supported_rate23a(cur_network->SupportedRates, supportRateNum);
		break;
	}
	mask |= ((raid<<28)&0xf0000000);
	mask &= 0xffffffff;
	mask &= ~filter;
	init_rate = get_highest_rate_idx23a(mask)&0x3f;

	if (pHalData->fw_ractrl) {
		u8 arg = 0;

		arg = mac_id&0x1f;/* MACID */
		arg |= BIT(7);
		if (true == shortGIrate)
			arg |= BIT(5);

		RTPRINT(FBT, BT_TRACE,
			("[BTCoex], Update FW RAID entry, MASK = 0x%08x, arg = 0x%02x\n",
			mask, arg));

		rtl8723a_set_raid_cmd(padapter, mask, arg);
	} else {
		if (shortGIrate)
			init_rate |= BIT(6);

		rtw_write8(padapter, (REG_INIDATA_RATE_SEL+mac_id), init_rate);
	}

	psta->init_rate = init_rate;
	pdmpriv->INIDATA_RATE[mac_id] = init_rate;
}

static void btdm_1AntUpdateHalRAMaskForSCO(struct rtw_adapter *padapter, u8 forceUpdate)
{
	struct btdm_8723a_1ant *pBtdm8723;
	struct sta_priv *pstapriv;
	struct wlan_bssid_ex *cur_network;
	struct sta_info *psta;
	u32 macid;
	u32 filter = 0;

	pBtdm8723 = &GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant;

	if ((pBtdm8723->bRAChanged == true) && (forceUpdate == false))
		return;

	pstapriv = &padapter->stapriv;
	cur_network = &padapter->mlmeextpriv.mlmext_info.network;
	psta = rtw_get_stainfo23a(pstapriv, cur_network->MacAddress);
	macid = psta->mac_id;

	filter |= BIT(_1M_RATE_);
	filter |= BIT(_2M_RATE_);
	filter |= BIT(_5M_RATE_);
	filter |= BIT(_11M_RATE_);
	filter |= BIT(_6M_RATE_);
	filter |= BIT(_9M_RATE_);

	btdm_1AntUpdateHalRAMask(padapter, macid, filter);

	pBtdm8723->bRAChanged = true;
}

