torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
static void btdm_1AntRecoverHalRAMask(struct rtw_adapter *padapter)
{
	struct btdm_8723a_1ant *pBtdm8723;
	struct sta_priv *pstapriv;
	struct wlan_bssid_ex *cur_network;
	struct sta_info *psta;

	pBtdm8723 = &GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant;

	if (pBtdm8723->bRAChanged == false)
		return;

	pstapriv = &padapter->stapriv;
	cur_network = &padapter->mlmeextpriv.mlmext_info.network;
	psta = rtw_get_stainfo23a(pstapriv, cur_network->MacAddress);

	Update_RA_Entry23a(padapter, psta);

	pBtdm8723->bRAChanged = false;
}

static void
btdm_1AntBTStateChangeHandler(struct rtw_adapter *padapter,
			      enum bt_state_1ant oldState, enum bt_state_1ant newState)
{
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT state change, %s => %s\n", BtStateString[oldState], BtStateString[newState]));

	/*  BT default ignore wlan active, */
	/*  WiFi MUST disable this when BT is enable */
	if (newState > BT_INFO_STATE_DISABLED)
		btdm_SetFwIgnoreWlanAct(padapter, false);

	if ((check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE)) &&
	    (BTDM_IsWifiConnectionExist(padapter))) {
		if ((newState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
		    (newState == BT_INFO_STATE_ACL_SCO_BUSY)) {
			btdm_1AntUpdateHalRAMaskForSCO(padapter, false);
		} else {
			/*  Recover original RA setting */
			btdm_1AntRecoverHalRAMask(padapter);
		}
	} else {
		GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bRAChanged = false;
	}

	if (oldState == newState)
		return;

	if (oldState == BT_INFO_STATE_ACL_ONLY_BUSY) {
		struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCnt = 0;
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCntForSCO = 0;
	}

	if ((oldState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
	    (oldState == BT_INFO_STATE_ACL_SCO_BUSY)) {
		struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
		pHalData->bt_coexist.halCoex8723.btdm1Ant.psTdmaMonitorCntForSCO = 0;
	}

	/*  Active 2Ant mechanism when BT Connected */
	if ((oldState == BT_INFO_STATE_DISABLED) ||
	    (oldState == BT_INFO_STATE_NO_CONNECTION)) {
		if ((newState != BT_INFO_STATE_DISABLED) &&
		    (newState != BT_INFO_STATE_NO_CONNECTION)) {
			BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_SHRINK);
			BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
			BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
		}
	} else {
		if ((newState == BT_INFO_STATE_DISABLED) ||
		    (newState == BT_INFO_STATE_NO_CONNECTION)) {
			BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_RESUME);
			BTDM_AGCTable(padapter, BT_AGCTABLE_OFF);
			BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_OFF);
		}
	}
}

static void btdm_1AntBtCoexistHandler(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_coexist_8723a *pBtCoex8723;
	struct btdm_8723a_1ant *pBtdm8723;

	pHalData = GET_HAL_DATA(padapter);
	pBtCoex8723 = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex8723->btdm1Ant;
	padapter->pwrctrlpriv.btcoex_rfon = false;
	if (BT_IsBtDisabled(padapter)) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is disabled\n"));

		if (BTDM_IsWifiConnectionExist(padapter)) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is connected\n"));

			if (BTDM_IsWifiBusy(padapter)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Wifi is busy\n"));
				btdm_1AntSetPSTDMA(padapter, false, 0, false, 9);
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Wifi is idle\n"));
				_btdm_1AntSetPSTDMA(padapter, true, 2, 1, false, 9);
			}
		} else {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is disconnected\n"));

			btdm_1AntSetPSTDMA(padapter, false, 0, false, 9);
		}
	} else {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], BT is enabled\n"));

		if (BTDM_IsWifiConnectionExist(padapter)) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is connected\n"));

			btdm_1AntWifiParaAdjust(padapter, true);
			btdm_1AntCoexProcessForWifiConnect(padapter);
		} else {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is disconnected\n"));

			/*  Antenna switch at BT side(0x870 = 0x300, 0x860 = 0x210) after PSTDMA off */
			btdm_1AntWifiParaAdjust(padapter, false);
			btdm_1AntSetPSTDMA(padapter, false, 0, false, 0);
		}
	}

	btdm_1AntBTStateChangeHandler(padapter, pBtCoex8723->prec2hBtInfo, pBtCoex8723->c2hBtInfo);
	pBtCoex8723->prec2hBtInfo = pBtCoex8723->c2hBtInfo;
}

void BTDM_1AntSignalCompensation(struct rtw_adapter *padapter, u8 *rssi_wifi, u8 *rssi_bt)
{
	struct hal_data_8723a *pHalData;
	struct btdm_8723a_1ant *pBtdm8723;
	u8 RSSI_WiFi_Cmpnstn, RSSI_BT_Cmpnstn;

	pHalData = GET_HAL_DATA(padapter);
	pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm1Ant;
	RSSI_WiFi_Cmpnstn = 0;
	RSSI_BT_Cmpnstn = 0;

	switch (pBtdm8723->curPsTdma) {
	case 1: /*  WiFi 52ms */
		RSSI_WiFi_Cmpnstn = 11; /*  22*0.48 */
		break;
	case 2: /*  WiFi 36ms */
		RSSI_WiFi_Cmpnstn = 14; /*  22*0.64 */
		break;
	case 9: /*  WiFi 20ms */
		RSSI_WiFi_Cmpnstn = 18; /*  22*0.80 */
		break;
	case 11: /*  WiFi 10ms */
		RSSI_WiFi_Cmpnstn = 20; /*  22*0.90 */
		break;
	case 4: /*  WiFi 21ms */
		RSSI_WiFi_Cmpnstn = 17; /*  22*0.79 */
		break;
	case 16: /*  WiFi 24ms */
		RSSI_WiFi_Cmpnstn = 18; /*  22*0.76 */
		break;
	case 18: /*  WiFi 37ms */
		RSSI_WiFi_Cmpnstn = 14; /*  22*0.64 */
		break;
	case 23: /* Level-1, Antenna switch to BT at all time */
	case 24: /* Level-2, Antenna switch to BT at all time */
	case 25: /* Level-3a, Antenna switch to BT at all time */
	case 26: /* Level-3b, Antenna switch to BT at all time */
	case 27: /* Level-3b, Antenna switch to BT at all time */
	case 33: /* BT SCO & WiFi site survey */
		RSSI_WiFi_Cmpnstn = 22;
		break;
	default:
		break;
	}

	if (rssi_wifi && RSSI_WiFi_Cmpnstn) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntSgnlCmpnstn, case %d, WiFiCmpnstn =%d(%d => %d)\n",
				pBtdm8723->curPsTdma, RSSI_WiFi_Cmpnstn, *rssi_wifi, *rssi_wifi+RSSI_WiFi_Cmpnstn));
		*rssi_wifi += RSSI_WiFi_Cmpnstn;
	}

	if (rssi_bt && RSSI_BT_Cmpnstn) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1AntSgnlCmpnstn, case %d, BTCmpnstn =%d(%d => %d)\n",
				pBtdm8723->curPsTdma, RSSI_BT_Cmpnstn, *rssi_bt, *rssi_bt+RSSI_BT_Cmpnstn));
		*rssi_bt += RSSI_BT_Cmpnstn;
	}
}

