torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
static void BTDM_1AntParaInit(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_coexist_8723a *pBtCoex;
	struct btdm_8723a_1ant *pBtdm8723;

	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex->btdm1Ant;

	/*  Enable counter statistics */
	rtw_write8(padapter, 0x76e, 0x4);
	btdm_1AntPtaParaReload(padapter);

	pBtdm8723->wifiRssiThresh = 48;

	pBtdm8723->bWiFiHalt = false;
	pBtdm8723->bRAChanged = false;

	if ((pBtCoex->c2hBtInfo != BT_INFO_STATE_DISABLED) &&
	    (pBtCoex->c2hBtInfo != BT_INFO_STATE_NO_CONNECTION)) {
		BTDM_SetSwRfRxLpfCorner(padapter, BT_RF_RX_LPF_CORNER_SHRINK);
		BTDM_AGCTable(padapter, BT_AGCTABLE_ON);
		BTDM_BBBackOffLevel(padapter, BT_BB_BACKOFF_ON);
	}
}

static void BTDM_1AntForHalt(struct rtw_adapter *padapter)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for halt\n"));

	GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bWiFiHalt = true;

	btdm_1AntWifiParaAdjust(padapter, false);

	/*  don't use btdm_1AntSetPSTDMA() here */
	/*  it will call rtw_set_ps_mode23a() and request pwrpriv->lock. */
	/*  This will lead to deadlock, if this function is called in IPS */
	/*  Lucas@20130205 */
	btdm_1AntPsTdma(padapter, false, 0);

	btdm_SetFwIgnoreWlanAct(padapter, true);
}

static void BTDM_1AntLpsLeave(struct rtw_adapter *padapter)
{
	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for LPS Leave\n"));

	/*  Prevent from entering LPS again */
	GET_HAL_DATA(padapter)->bt_coexist.halCoex8723.btdm1Ant.bWiFiHalt = true;

	btdm_1AntSetPSTDMA(padapter, false, 0, false, 8);
/*btdm_1AntPsTdma(padapter, false, 8); */
}

static void BTDM_1AntWifiAssociateNotify(struct rtw_adapter *padapter, u8 type)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for associate, type =%d\n", type));

	if (type) {
		rtl8723a_CheckAntenna_Selection(padapter);
		if (BT_IsBtDisabled(padapter)) {
			btdm_1AntSetPSTDMA(padapter, false, 0, false, 9);
		} else {
			struct bt_coexist_8723a *pBtCoex;
			u8 BtState;

			pBtCoex = &pHalData->bt_coexist.halCoex8723;
			BtState = pBtCoex->c2hBtInfo;

			btdm_1AntTSFSwitch(padapter, true);

			if ((BtState == BT_INFO_STATE_NO_CONNECTION) ||
			    (BtState == BT_INFO_STATE_CONNECT_IDLE)) {
				btdm_1AntSetPSTDMA(padapter, false, 0, true, 28);
			} else if ((BtState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
				   (BtState == BT_INFO_STATE_ACL_SCO_BUSY)) {
				btdm_1AntSetPSTDMA(padapter, false, 0, false, 8);
				rtw_write32(padapter, 0x6c0, 0x5a5a5a5a);
				rtw_write32(padapter, 0x6c4, 0x5a5a5a5a);
			} else if ((BtState == BT_INFO_STATE_ACL_ONLY_BUSY) ||
				   (BtState == BT_INFO_STATE_ACL_INQ_OR_PAG)) {
				if (pBtCoex->c2hBtProfile == BT_INFO_HID)
					btdm_1AntSetPSTDMA(padapter, false, 0, true, 35);
				else
					btdm_1AntSetPSTDMA(padapter, false, 0, true, 29);
			}
		}
	} else {
		if (BT_IsBtDisabled(padapter)) {
			if (!BTDM_IsWifiConnectionExist(padapter)) {
				btdm_1AntPsTdma(padapter, false, 0);
				btdm_1AntTSFSwitch(padapter, false);
			}
		}

		btdm_1AntBtCoexistHandler(padapter);
	}
}

static void
BTDM_1AntMediaStatusNotify(struct rtw_adapter *padapter,
			   enum rt_media_status mstatus)
{
	struct bt_coexist_8723a *pBtCoex;

	pBtCoex = &GET_HAL_DATA(padapter)->bt_coexist.halCoex8723;

	RTPRINT(FBT, BT_TRACE, ("\n\n[BTCoex]******************************\n"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], MediaStatus, WiFi %s !!\n",
			mstatus == RT_MEDIA_CONNECT?"CONNECT":"DISCONNECT"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex]******************************\n"));

	if (RT_MEDIA_CONNECT == mstatus) {
		if (check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE)) {
			if ((pBtCoex->c2hBtInfo == BT_INFO_STATE_SCO_ONLY_BUSY) ||
			    (pBtCoex->c2hBtInfo == BT_INFO_STATE_ACL_SCO_BUSY))
				btdm_1AntUpdateHalRAMaskForSCO(padapter, true);
		}

		padapter->pwrctrlpriv.DelayLPSLastTimeStamp = jiffies;
		BTDM_1AntForDhcp(padapter);
	} else {
		/* DBG_8723A("%s rtl8723a_DeinitAntenna_Selection\n", __func__); */
		rtl8723a_DeinitAntenna_Selection(padapter);
		btdm_1AntBtCoexistHandler(padapter);
		pBtCoex->btdm1Ant.bRAChanged = false;
	}
}

void BTDM_1AntForDhcp(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	u8 BtState;
	struct bt_coexist_8723a *pBtCoex;
	struct btdm_8723a_1ant *pBtdm8723;

	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;
	BtState = pBtCoex->c2hBtInfo;
	pBtdm8723 = &pBtCoex->btdm1Ant;

	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for DHCP\n"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, WiFi is %s\n", BTDM_IsWifiBusy(padapter)?"Busy":"IDLE"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for DHCP, %s\n", BtStateString[BtState]));

	BTDM_1AntWifiAssociateNotify(padapter, true);
}

static void BTDM_1AntWifiScanNotify(struct rtw_adapter *padapter, u8 scanType)
{
	struct hal_data_8723a *pHalData;
	u8 BtState;
	struct bt_coexist_8723a *pBtCoex;
	struct btdm_8723a_1ant *pBtdm8723;

	pHalData = GET_HAL_DATA(padapter);
	BtState = pHalData->bt_coexist.halCoex8723.c2hBtInfo;
	pBtCoex = &pHalData->bt_coexist.halCoex8723;
	pBtdm8723 = &pBtCoex->btdm1Ant;

	RTPRINT(FBT, BT_TRACE, ("\n[BTCoex], 1Ant for wifi scan =%d!!\n", scanType));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for wifi scan, WiFi is %s\n", BTDM_IsWifiBusy(padapter)?"Busy":"IDLE"));
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1Ant for wifi scan, %s\n", BtStateString[BtState]));

	if (scanType) {
		rtl8723a_CheckAntenna_Selection(padapter);
		if (BT_IsBtDisabled(padapter)) {
			btdm_1AntSetPSTDMA(padapter, false, 0, false, 9);
		} else if (BTDM_IsWifiConnectionExist(padapter) == false) {
			BTDM_1AntWifiAssociateNotify(padapter, true);
		} else {
			if ((BtState == BT_INFO_STATE_SCO_ONLY_BUSY) ||
			    (BtState == BT_INFO_STATE_ACL_SCO_BUSY)) {
				if (pBtCoex->bC2hBtInquiryPage) {
					btdm_1AntSetPSTDMA(padapter, false, 0, true, 32);
				} else {
					padapter->pwrctrlpriv.btcoex_rfon = true;
					btdm_1AntSetPSTDMA(padapter, true, 0, true, 33);
				}
			} else if (true == pBtCoex->bC2hBtInquiryPage) {
				padapter->pwrctrlpriv.btcoex_rfon = true;
				btdm_1AntSetPSTDMA(padapter, true, 0, true, 30);
			} else if (BtState == BT_INFO_STATE_ACL_ONLY_BUSY) {
				padapter->pwrctrlpriv.btcoex_rfon = true;
				if (pBtCoex->c2hBtProfile == BT_INFO_HID)
					btdm_1AntSetPSTDMA(padapter, true, 0, true, 34);
				else
					btdm_1AntSetPSTDMA(padapter, true, 0, true, 4);
			} else {
				padapter->pwrctrlpriv.btcoex_rfon = true;
				btdm_1AntSetPSTDMA(padapter, true, 0, true, 5);
			}
		}

		btdm_NotifyFwScan(padapter, 1);
	} else {
		/*  WiFi_Finish_Scan */
		btdm_NotifyFwScan(padapter, 0);
		btdm_1AntBtCoexistHandler(padapter);
	}
}

static void BTDM_1AntFwC2hBtInfo8723A(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_coexist_8723a *pBtCoex;
	u8 u1tmp, btState;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	u1tmp = pBtCoex->c2hBtInfoOriginal;
	/*  sco BUSY bit is not used on voice over PCM platform */
	btState = u1tmp & 0xF;
	pBtCoex->c2hBtProfile = u1tmp & 0xE0;

	/*  default set bt to idle state. */
	pBtMgnt->ExtConfig.bBTBusy = false;
	pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;

