torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	/*  check BIT2 first ==> check if bt is under inquiry or page scan */
	if (btState & BIT(2))
		pBtCoex->bC2hBtInquiryPage = true;
	else
		pBtCoex->bC2hBtInquiryPage = false;
	btState &= ~BIT(2);

	if (!(btState & BIT(0))) {
		pBtCoex->c2hBtInfo = BT_INFO_STATE_NO_CONNECTION;
	} else {
		if (btState == 0x1) {
			pBtCoex->c2hBtInfo = BT_INFO_STATE_CONNECT_IDLE;
		} else if (btState == 0x9) {
			if (pBtCoex->bC2hBtInquiryPage == true)
				pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_INQ_OR_PAG;
			else
				pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_ONLY_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = true;
		} else if (btState == 0x3) {
			pBtCoex->c2hBtInfo = BT_INFO_STATE_SCO_ONLY_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = true;
		} else if (btState == 0xb) {
			pBtCoex->c2hBtInfo = BT_INFO_STATE_ACL_SCO_BUSY;
			pBtMgnt->ExtConfig.bBTBusy = true;
		} else {
			pBtCoex->c2hBtInfo = BT_INFO_STATE_MAX;
		}
		if (pBtMgnt->ExtConfig.bBTBusy)
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
	}

	if ((BT_INFO_STATE_NO_CONNECTION == pBtCoex->c2hBtInfo) ||
	    (BT_INFO_STATE_CONNECT_IDLE == pBtCoex->c2hBtInfo)) {
		if (pBtCoex->bC2hBtInquiryPage)
			pBtCoex->c2hBtInfo = BT_INFO_STATE_INQ_OR_PAG;
	}

	RTPRINT(FBT, BT_TRACE, ("[BTC2H], %s(%d)\n",
			BtStateString[pBtCoex->c2hBtInfo], pBtCoex->c2hBtInfo));

	if (pBtCoex->c2hBtProfile != BT_INFO_HID)
		pBtCoex->c2hBtProfile &= ~BT_INFO_HID;
}

void BTDM_1AntBtCoexist8723A(struct rtw_adapter *padapter)
{
	struct mlme_priv *pmlmepriv;
	struct hal_data_8723a *pHalData;
	unsigned long delta_time;

	pmlmepriv = &padapter->mlmepriv;
	pHalData = GET_HAL_DATA(padapter);

	if (check_fwstate(pmlmepriv, WIFI_SITE_MONITOR)) {
		/*  already done in BTDM_1AntForScan() */
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under scan progress!!\n"));
		return;
	}

	if (check_fwstate(pmlmepriv, WIFI_UNDER_LINKING)) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under link progress!!\n"));
		return;
	}

	/*  under DHCP(Special packet) */
	delta_time = jiffies - padapter->pwrctrlpriv.DelayLPSLastTimeStamp;
	delta_time = jiffies_to_msecs(delta_time);
	if (delta_time < 500) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], wifi is under DHCP "
					"progress(%li ms)!!\n", delta_time));
		return;
	}

	BTDM_CheckWiFiState(padapter);

	btdm_1AntBtCoexistHandler(padapter);
}

/*  ===== End of sync from SD7 driver HAL/BTCoexist/HalBtc87231Ant.c ===== */
#endif

#ifdef __HALBTC87232ANT_C__ /*  HAL/BTCoexist/HalBtc87232Ant.c */
/*  ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc87232Ant.c ===== */

/*  local function start with btdm_ */
static u8 btdm_ActionAlgorithm(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct btdm_8723a_2ant *pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	u8 bScoExist = false, bBtLinkExist = false, bBtHsModeExist = false;
	u8 algorithm = BT_2ANT_COEX_ALGO_UNDEFINED;

	if (pBtMgnt->ExtConfig.NumberOfHandle)
		bBtLinkExist = true;
	if (pBtMgnt->ExtConfig.NumberOfSCO)
		bScoExist = true;
	if (BT_HsConnectionEstablished(padapter))
		bBtHsModeExist = true;

	/*  here we get BT status first */
	/*  1) initialize */
	pBtdm8723->btStatus = BT_2ANT_BT_STATUS_IDLE;

	if ((bScoExist) || (bBtHsModeExist) ||
	    (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID))) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO or HID or HS exists, set BT non-idle !!!\n"));
		pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
	} else {
		/*  A2dp profile */
		if ((pBtMgnt->ExtConfig.NumberOfHandle == 1) &&
		    (BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP))) {
			if (BTDM_BtTxRxCounterL(padapter) < 100) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP, low priority tx+rx < 100, set BT connected-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP, low priority tx+rx >= 100, set BT non-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
			}
		}
		/*  Pan profile */
		if ((pBtMgnt->ExtConfig.NumberOfHandle == 1) &&
		    (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN))) {
			if (BTDM_BtTxRxCounterL(padapter) < 600) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN, low priority tx+rx < 600, set BT connected-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
			} else {
				if (pHalData->bt_coexist.halCoex8723.lowPriorityTx) {
					if ((pHalData->bt_coexist.halCoex8723.lowPriorityRx /
					    pHalData->bt_coexist.halCoex8723.lowPriorityTx) > 9) {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN, low priority rx/tx > 9, set BT connected-idle!!!\n"));
						pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
					}
				}
			}
			if (BT_2ANT_BT_STATUS_CONNECTED_IDLE != pBtdm8723->btStatus) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN, set BT non-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
			}
		}
		/*  Pan+A2dp profile */
		if ((pBtMgnt->ExtConfig.NumberOfHandle == 2) &&
		    (BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) &&
		    (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN))) {
			if (BTDM_BtTxRxCounterL(padapter) < 600) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP, low priority tx+rx < 600, set BT connected-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
			} else {
				if (pHalData->bt_coexist.halCoex8723.lowPriorityTx) {
					if ((pHalData->bt_coexist.halCoex8723.lowPriorityRx /
					    pHalData->bt_coexist.halCoex8723.lowPriorityTx) > 9) {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP, low priority rx/tx > 9, set BT connected-idle!!!\n"));
						pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
					}
				}
			}
			if (BT_2ANT_BT_STATUS_CONNECTED_IDLE != pBtdm8723->btStatus) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN+A2DP, set BT non-idle!!!\n"));
				pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
			}
		}
	}
	if (BT_2ANT_BT_STATUS_IDLE != pBtdm8723->btStatus)
		pBtMgnt->ExtConfig.bBTBusy = true;
	else
		pBtMgnt->ExtConfig.bBTBusy = false;

	if (!bBtLinkExist) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], No profile exists!!!\n"));
		return algorithm;
	}

	if (pBtMgnt->ExtConfig.NumberOfHandle == 1) {
		if (bScoExist) {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO only\n"));
			algorithm = BT_2ANT_COEX_ALGO_SCO;
		} else {
			if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID only\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID;
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP only\n"));
				algorithm = BT_2ANT_COEX_ALGO_A2DP;
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN(HS) only\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANHS;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN(EDR) only\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR;
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle =%d \n",
				pBtMgnt->ExtConfig.NumberOfHandle));
			}
		}
	} else if (pBtMgnt->ExtConfig.NumberOfHandle == 2) {
		if (bScoExist) {
			if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID;
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP\n"));
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_SCO;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO exists but why NO matched ACL profile for NumberOfHandle =%d\n",
				pBtMgnt->ExtConfig.NumberOfHandle));
			}
		} else {
			if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
			    BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
		} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
			   BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				}
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN) &&
				   BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_A2DP;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_A2DP;
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle =%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
		}
	} else if (pBtMgnt->ExtConfig.NumberOfHandle == 3) {
		if (bScoExist) {
			if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
			    BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + HID + A2DP\n"));
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
				   BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				}
			} else if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN) &&
				   BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_SCO;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP + PAN(EDR)\n"));
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO exists but why NO matched profile for NumberOfHandle =%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
		} else {
			if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
			    BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN) &&
			    BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANHS;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR;
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle =%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
		}
	} else if (pBtMgnt->ExtConfig.NumberOfHandle >= 3) {
		if (bScoExist) {
			if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
			    BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN) &&
			    BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
				if (bBtHsModeExist)
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + HID + A2DP + PAN(HS)\n"));
				else
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + HID + A2DP + PAN(EDR)\n"));
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO exists but why NO matched profile for NumberOfHandle =%d\n",
					pBtMgnt->ExtConfig.NumberOfHandle));
			}
		} else {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! NO matched profile for NumberOfHandle =%d\n",
				pBtMgnt->ExtConfig.NumberOfHandle));
		}
	}
	return algorithm;
}

static u8 btdm_NeedToDecBtPwr(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u8 bRet = false;

