torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, false);
		btdm_2AntDacSwing(padapter, false, 0xc0);

		bCommon = true;
	} else if (((BTDM_IsWifiConnectionExist(padapter)) ||
		   (check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING)))) &&
		   (BT_2ANT_BT_STATUS_IDLE == pBtdm8723->btStatus)) {
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + BT idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, true);
		btdm_2AntRfShrink(padapter, false);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, false);
		btdm_2AntPsTdma(padapter, false, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, true);

		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, false);
		btdm_2AntDacSwing(padapter, false, 0xc0);

		bCommon = true;
	} else if ((!BTDM_IsWifiConnectionExist(padapter)) &&
		   (!check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))) &&
		   (BT_2ANT_BT_STATUS_CONNECTED_IDLE == pBtdm8723->btStatus)) {
		RTPRINT(FBT, BT_TRACE, ("Wifi idle + Bt connected idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, true);
		btdm_2AntRfShrink(padapter, true);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, false);
		btdm_2AntPsTdma(padapter, false, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, false);

		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, false);
		btdm_2AntDacSwing(padapter, false, 0xc0);

		bCommon = true;
	} else if (((BTDM_IsWifiConnectionExist(padapter)) ||
		   (check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING)))) &&
		   (BT_2ANT_BT_STATUS_CONNECTED_IDLE == pBtdm8723->btStatus)) {
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + Bt connected idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, true);
		btdm_2AntRfShrink(padapter, true);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, false);
		btdm_2AntPsTdma(padapter, false, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, true);

		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, false);
		btdm_2AntDacSwing(padapter, false, 0xc0);

		bCommon = true;
	} else if ((!BTDM_IsWifiConnectionExist(padapter)) &&
		   (!check_fwstate(&padapter->mlmepriv, (_FW_UNDER_SURVEY|_FW_UNDER_LINKING))) &&
		   (BT_2ANT_BT_STATUS_NON_IDLE == pBtdm8723->btStatus)) {
		RTPRINT(FBT, BT_TRACE, ("Wifi idle + BT non-idle!!\n"));

		btdm_2AntLowPenaltyRa(padapter, true);
		btdm_2AntRfShrink(padapter, true);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);

		btdm_2AntIgnoreWlanAct(padapter, false);
		btdm_2AntPsTdma(padapter, false, 0);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);
		btdm_2AntDecBtPwr(padapter, false);

		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, false);
		btdm_2AntDacSwing(padapter, false, 0xc0);

		bCommon = true;
	} else {
		RTPRINT(FBT, BT_TRACE, ("Wifi non-idle + BT non-idle!!\n"));
		btdm_2AntLowPenaltyRa(padapter, true);
		btdm_2AntRfShrink(padapter, true);
		btdm_2AntCoexTable(padapter, 0x55555555, 0xffff, 0x3);
		btdm_2AntIgnoreWlanAct(padapter, false);
		btdm_2AntFwDacSwingLvl(padapter, 0x20);

		bCommon = false;
	}
	return bCommon;
}

static void
btdm_2AntTdmaDurationAdjust(struct rtw_adapter *padapter, u8 bScoHid,
			    u8 bTxPause, u8 maxInterval)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct btdm_8723a_2ant *pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;
	static s32		up, dn, m, n, WaitCount;
	s32			result;   /* 0: no change, +1: increase WiFi duration, -1: decrease WiFi duration */
	u8 retryCount = 0;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], TdmaDurationAdjust()\n"));

	if (pBtdm8723->bResetTdmaAdjust) {
		pBtdm8723->bResetTdmaAdjust = false;
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], first run TdmaDurationAdjust()!!\n"));
		if (bScoHid) {
			if (bTxPause) {
				if (maxInterval == 1) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (maxInterval == 2) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (maxInterval == 3) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				}
			} else {
				if (maxInterval == 1) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (maxInterval == 2) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (maxInterval == 3) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				}
			}
		} else {
			if (bTxPause) {
				if (maxInterval == 1) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (maxInterval == 2) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (maxInterval == 3) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				}
			} else {
				if (maxInterval == 1) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (maxInterval == 2) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (maxInterval == 3) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				}
			}
		}
		up = 0;
		dn = 0;
		m = 1;
		n = 3;
		result = 0;
		WaitCount = 0;
	} else {
		/* accquire the BT TRx retry count from BT_Info byte2 */
		retryCount = pHalData->bt_coexist.halCoex8723.btRetryCnt;
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], retryCount = %d\n", retryCount));
		result = 0;
		WaitCount++;

		if (retryCount == 0) {  /*  no retry in the last 2-second duration */
			up++;
			dn--;

			if (dn <= 0)
				dn = 0;

