torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
			if (up >= n) {	/*  if 連續 n 個2秒 retry count為0, 則調寬WiFi duration */
				WaitCount = 0;
				n = 3;
				up = 0;
				dn = 0;
				result = 1;
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Increase wifi duration!!\n"));
			}
		} else if (retryCount <= 3) {	/*  <= 3 retry in the last 2-second duration */
			up--;
			dn++;

			if (up <= 0)
				up = 0;

			if (dn == 2) {	/*  if 連續 2 個2秒 retry count< 3, 則調窄WiFi duration */
				if (WaitCount <= 2)
					m++; /*  避免一直在兩個level中來回 */
				else
					m = 1;

				if (m >= 20) /* m 最大值 = 20 ' 最大120秒 recheck是否調整 WiFi duration. */
					m = 20;

				n = 3*m;
				up = 0;
				dn = 0;
				WaitCount = 0;
				result = -1;
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], Decrease wifi duration for retryCounter<3!!\n"));
			}
		} else {  /* retry count > 3, 只要1次 retry count > 3, 則調窄WiFi duration */
			if (WaitCount == 1)
				m++; /*  避免一直在兩個level中來回 */
			else
				m = 1;

			if (m >= 20) /* m 最大值 = 20 ' 最大120秒 recheck是否調整 WiFi duration. */
				m = 20;
			n = 3*m;
			up = 0;
			dn = 0;
			WaitCount = 0;
			result = -1;
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], Decrease wifi duration for retryCounter>3!!\n"));
		}

		RTPRINT(FBT, BT_TRACE, ("[BTCoex], max Interval = %d\n", maxInterval));
		if (maxInterval == 1) {
			if (bTxPause) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], TxPause = 1\n"));
				if (pBtdm8723->curPsTdma == 1) {
					btdm_2AntPsTdma(padapter, true, 5);
					pBtdm8723->psTdmaDuAdjType = 5;
				} else if (pBtdm8723->curPsTdma == 2) {
					btdm_2AntPsTdma(padapter, true, 6);
					pBtdm8723->psTdmaDuAdjType = 6;
				} else if (pBtdm8723->curPsTdma == 3) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (pBtdm8723->curPsTdma == 4) {
					btdm_2AntPsTdma(padapter, true, 8);
					pBtdm8723->psTdmaDuAdjType = 8;
				}
				if (pBtdm8723->curPsTdma == 9) {
					btdm_2AntPsTdma(padapter, true, 13);
					pBtdm8723->psTdmaDuAdjType = 13;
				} else if (pBtdm8723->curPsTdma == 10) {
					btdm_2AntPsTdma(padapter, true, 14);
					pBtdm8723->psTdmaDuAdjType = 14;
				} else if (pBtdm8723->curPsTdma == 11) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (pBtdm8723->curPsTdma == 12) {
					btdm_2AntPsTdma(padapter, true, 16);
					pBtdm8723->psTdmaDuAdjType = 16;
				}

				if (result == -1) {
					if (pBtdm8723->curPsTdma == 5) {
						btdm_2AntPsTdma(padapter, true, 6);
						pBtdm8723->psTdmaDuAdjType = 6;
					} else if (pBtdm8723->curPsTdma == 6) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 7) {
						btdm_2AntPsTdma(padapter, true, 8);
						pBtdm8723->psTdmaDuAdjType = 8;
					} else if (pBtdm8723->curPsTdma == 13) {
						btdm_2AntPsTdma(padapter, true, 14);
						pBtdm8723->psTdmaDuAdjType = 14;
					} else if (pBtdm8723->curPsTdma == 14) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 15) {
						btdm_2AntPsTdma(padapter, true, 16);
						pBtdm8723->psTdmaDuAdjType = 16;
					}
				} else if (result == 1) {
					if (pBtdm8723->curPsTdma == 8) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 7) {
						btdm_2AntPsTdma(padapter, true, 6);
						pBtdm8723->psTdmaDuAdjType = 6;
					} else if (pBtdm8723->curPsTdma == 6) {
						btdm_2AntPsTdma(padapter, true, 5);
						pBtdm8723->psTdmaDuAdjType = 5;
					} else if (pBtdm8723->curPsTdma == 16) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 15) {
						btdm_2AntPsTdma(padapter, true, 14);
						pBtdm8723->psTdmaDuAdjType = 14;
					} else if (pBtdm8723->curPsTdma == 14) {
						btdm_2AntPsTdma(padapter, true, 13);
						pBtdm8723->psTdmaDuAdjType = 13;
					}
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], TxPause = 0\n"));
				if (pBtdm8723->curPsTdma == 5) {
					btdm_2AntPsTdma(padapter, true, 1);
					pBtdm8723->psTdmaDuAdjType = 1;
				} else if (pBtdm8723->curPsTdma == 6) {
					btdm_2AntPsTdma(padapter, true, 2);
					pBtdm8723->psTdmaDuAdjType = 2;
				} else if (pBtdm8723->curPsTdma == 7) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (pBtdm8723->curPsTdma == 8) {
					btdm_2AntPsTdma(padapter, true, 4);
					pBtdm8723->psTdmaDuAdjType = 4;
				}
				if (pBtdm8723->curPsTdma == 13) {
					btdm_2AntPsTdma(padapter, true, 9);
					pBtdm8723->psTdmaDuAdjType = 9;
				} else if (pBtdm8723->curPsTdma == 14) {
					btdm_2AntPsTdma(padapter, true, 10);
					pBtdm8723->psTdmaDuAdjType = 10;
				} else if (pBtdm8723->curPsTdma == 15) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (pBtdm8723->curPsTdma == 16) {
					btdm_2AntPsTdma(padapter, true, 12);
					pBtdm8723->psTdmaDuAdjType = 12;
				}

				if (result == -1) {
					if (pBtdm8723->curPsTdma == 1) {
						btdm_2AntPsTdma(padapter, true, 2);
						pBtdm8723->psTdmaDuAdjType = 2;
					} else if (pBtdm8723->curPsTdma == 2) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 3) {
						btdm_2AntPsTdma(padapter, true, 4);
						pBtdm8723->psTdmaDuAdjType = 4;
					} else if (pBtdm8723->curPsTdma == 9) {
						btdm_2AntPsTdma(padapter, true, 10);
						pBtdm8723->psTdmaDuAdjType = 10;
					} else if (pBtdm8723->curPsTdma == 10) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 11) {
						btdm_2AntPsTdma(padapter, true, 12);
						pBtdm8723->psTdmaDuAdjType = 12;
					}
				} else if (result == 1) {
					if (pBtdm8723->curPsTdma == 4) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 3) {
						btdm_2AntPsTdma(padapter, true, 2);
						pBtdm8723->psTdmaDuAdjType = 2;
					} else if (pBtdm8723->curPsTdma == 2) {
						btdm_2AntPsTdma(padapter, true, 1);
						pBtdm8723->psTdmaDuAdjType = 1;
					} else if (pBtdm8723->curPsTdma == 12) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 11) {
						btdm_2AntPsTdma(padapter, true, 10);
						pBtdm8723->psTdmaDuAdjType = 10;
					} else if (pBtdm8723->curPsTdma == 10) {
						btdm_2AntPsTdma(padapter, true, 9);
						pBtdm8723->psTdmaDuAdjType = 9;
					}
				}
			}
		} else if (maxInterval == 2) {
			if (bTxPause) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], TxPause = 1\n"));
				if (pBtdm8723->curPsTdma == 1) {
					btdm_2AntPsTdma(padapter, true, 6);
					pBtdm8723->psTdmaDuAdjType = 6;
				} else if (pBtdm8723->curPsTdma == 2) {
					btdm_2AntPsTdma(padapter, true, 6);
					pBtdm8723->psTdmaDuAdjType = 6;
				} else if (pBtdm8723->curPsTdma == 3) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (pBtdm8723->curPsTdma == 4) {
					btdm_2AntPsTdma(padapter, true, 8);
					pBtdm8723->psTdmaDuAdjType = 8;
				}
				if (pBtdm8723->curPsTdma == 9) {
					btdm_2AntPsTdma(padapter, true, 14);
					pBtdm8723->psTdmaDuAdjType = 14;
				} else if (pBtdm8723->curPsTdma == 10) {
					btdm_2AntPsTdma(padapter, true, 14);
					pBtdm8723->psTdmaDuAdjType = 14;
				} else if (pBtdm8723->curPsTdma == 11) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (pBtdm8723->curPsTdma == 12) {
					btdm_2AntPsTdma(padapter, true, 16);
					pBtdm8723->psTdmaDuAdjType = 16;
				}
				if (result == -1) {
					if (pBtdm8723->curPsTdma == 5) {
						btdm_2AntPsTdma(padapter, true, 6);
						pBtdm8723->psTdmaDuAdjType = 6;
					} else if (pBtdm8723->curPsTdma == 6) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 7) {
						btdm_2AntPsTdma(padapter, true, 8);
						pBtdm8723->psTdmaDuAdjType = 8;
					} else if (pBtdm8723->curPsTdma == 13) {
						btdm_2AntPsTdma(padapter, true, 14);
						pBtdm8723->psTdmaDuAdjType = 14;
					} else if (pBtdm8723->curPsTdma == 14) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 15) {
						btdm_2AntPsTdma(padapter, true, 16);
						pBtdm8723->psTdmaDuAdjType = 16;
					}
				} else if (result == 1) {
					if (pBtdm8723->curPsTdma == 8) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 7) {
						btdm_2AntPsTdma(padapter, true, 6);
						pBtdm8723->psTdmaDuAdjType = 6;
					} else if (pBtdm8723->curPsTdma == 6) {
						btdm_2AntPsTdma(padapter, true, 6);
						pBtdm8723->psTdmaDuAdjType = 6;
					} else if (pBtdm8723->curPsTdma == 16) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 15) {
						btdm_2AntPsTdma(padapter, true, 14);
						pBtdm8723->psTdmaDuAdjType = 14;
					} else if (pBtdm8723->curPsTdma == 14) {
						btdm_2AntPsTdma(padapter, true, 14);
						pBtdm8723->psTdmaDuAdjType = 14;
					}
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], TxPause = 0\n"));
				if (pBtdm8723->curPsTdma == 5) {
					btdm_2AntPsTdma(padapter, true, 2);
					pBtdm8723->psTdmaDuAdjType = 2;
				} else if (pBtdm8723->curPsTdma == 6) {
					btdm_2AntPsTdma(padapter, true, 2);
					pBtdm8723->psTdmaDuAdjType = 2;
				} else if (pBtdm8723->curPsTdma == 7) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (pBtdm8723->curPsTdma == 8) {
					btdm_2AntPsTdma(padapter, true, 4);
					pBtdm8723->psTdmaDuAdjType = 4;
				}
				if (pBtdm8723->curPsTdma == 13) {
					btdm_2AntPsTdma(padapter, true, 10);
					pBtdm8723->psTdmaDuAdjType = 10;
				} else if (pBtdm8723->curPsTdma == 14) {
					btdm_2AntPsTdma(padapter, true, 10);
					pBtdm8723->psTdmaDuAdjType = 10;
				} else if (pBtdm8723->curPsTdma == 15) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (pBtdm8723->curPsTdma == 16) {
					btdm_2AntPsTdma(padapter, true, 12);
					pBtdm8723->psTdmaDuAdjType = 12;
				}
				if (result == -1) {
					if (pBtdm8723->curPsTdma == 1) {
						btdm_2AntPsTdma(padapter, true, 2);
						pBtdm8723->psTdmaDuAdjType = 2;
					} else if (pBtdm8723->curPsTdma == 2) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 3) {
						btdm_2AntPsTdma(padapter, true, 4);
						pBtdm8723->psTdmaDuAdjType = 4;
					} else if (pBtdm8723->curPsTdma == 9) {
						btdm_2AntPsTdma(padapter, true, 10);
						pBtdm8723->psTdmaDuAdjType = 10;
					} else if (pBtdm8723->curPsTdma == 10) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 11) {
						btdm_2AntPsTdma(padapter, true, 12);
						pBtdm8723->psTdmaDuAdjType = 12;
					}
				} else if (result == 1) {
					if (pBtdm8723->curPsTdma == 4) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 3) {
						btdm_2AntPsTdma(padapter, true, 2);
						pBtdm8723->psTdmaDuAdjType = 2;
					} else if (pBtdm8723->curPsTdma == 2) {
						btdm_2AntPsTdma(padapter, true, 2);
						pBtdm8723->psTdmaDuAdjType = 2;
					} else if (pBtdm8723->curPsTdma == 12) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 11) {
						btdm_2AntPsTdma(padapter, true, 10);
						pBtdm8723->psTdmaDuAdjType = 10;
					} else if (pBtdm8723->curPsTdma == 10) {
						btdm_2AntPsTdma(padapter, true, 10);
						pBtdm8723->psTdmaDuAdjType = 10;
					}
				}
			}
		} else if (maxInterval == 3) {
			if (bTxPause) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], TxPause = 1\n"));
				if (pBtdm8723->curPsTdma == 1) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (pBtdm8723->curPsTdma == 2) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (pBtdm8723->curPsTdma == 3) {
					btdm_2AntPsTdma(padapter, true, 7);
					pBtdm8723->psTdmaDuAdjType = 7;
				} else if (pBtdm8723->curPsTdma == 4) {
					btdm_2AntPsTdma(padapter, true, 8);
					pBtdm8723->psTdmaDuAdjType = 8;
				}
				if (pBtdm8723->curPsTdma == 9) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (pBtdm8723->curPsTdma == 10) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (pBtdm8723->curPsTdma == 11) {
					btdm_2AntPsTdma(padapter, true, 15);
					pBtdm8723->psTdmaDuAdjType = 15;
				} else if (pBtdm8723->curPsTdma == 12) {
					btdm_2AntPsTdma(padapter, true, 16);
					pBtdm8723->psTdmaDuAdjType = 16;
				}
				if (result == -1) {
					if (pBtdm8723->curPsTdma == 5) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 6) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 7) {
						btdm_2AntPsTdma(padapter, true, 8);
						pBtdm8723->psTdmaDuAdjType = 8;
					} else if (pBtdm8723->curPsTdma == 13) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 14) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 15) {
						btdm_2AntPsTdma(padapter, true, 16);
						pBtdm8723->psTdmaDuAdjType = 16;
					}
				} else if (result == 1) {
					if (pBtdm8723->curPsTdma == 8) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 7) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 6) {
						btdm_2AntPsTdma(padapter, true, 7);
						pBtdm8723->psTdmaDuAdjType = 7;
					} else if (pBtdm8723->curPsTdma == 16) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 15) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					} else if (pBtdm8723->curPsTdma == 14) {
						btdm_2AntPsTdma(padapter, true, 15);
						pBtdm8723->psTdmaDuAdjType = 15;
					}
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], TxPause = 0\n"));
				if (pBtdm8723->curPsTdma == 5) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (pBtdm8723->curPsTdma == 6) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (pBtdm8723->curPsTdma == 7) {
					btdm_2AntPsTdma(padapter, true, 3);
					pBtdm8723->psTdmaDuAdjType = 3;
				} else if (pBtdm8723->curPsTdma == 8) {
					btdm_2AntPsTdma(padapter, true, 4);
					pBtdm8723->psTdmaDuAdjType = 4;
				}
				if (pBtdm8723->curPsTdma == 13) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (pBtdm8723->curPsTdma == 14) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (pBtdm8723->curPsTdma == 15) {
					btdm_2AntPsTdma(padapter, true, 11);
					pBtdm8723->psTdmaDuAdjType = 11;
				} else if (pBtdm8723->curPsTdma == 16) {
					btdm_2AntPsTdma(padapter, true, 12);
					pBtdm8723->psTdmaDuAdjType = 12;
				}
				if (result == -1) {
					if (pBtdm8723->curPsTdma == 1) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 2) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 3) {
						btdm_2AntPsTdma(padapter, true, 4);
						pBtdm8723->psTdmaDuAdjType = 4;
					} else if (pBtdm8723->curPsTdma == 9) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 10) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 11) {
						btdm_2AntPsTdma(padapter, true, 12);
						pBtdm8723->psTdmaDuAdjType = 12;
					}
				} else if (result == 1) {
					if (pBtdm8723->curPsTdma == 4) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 3) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 2) {
						btdm_2AntPsTdma(padapter, true, 3);
						pBtdm8723->psTdmaDuAdjType = 3;
					} else if (pBtdm8723->curPsTdma == 12) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 11) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					} else if (pBtdm8723->curPsTdma == 10) {
						btdm_2AntPsTdma(padapter, true, 11);
						pBtdm8723->psTdmaDuAdjType = 11;
					}
				}
			}
		}
	}
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], PsTdma type : recordPsTdma =%d\n", pBtdm8723->psTdmaDuAdjType));
	/*  if current PsTdma not match with the recorded one (when scan, dhcp...), */
	/*  then we have to adjust it back to the previous record one. */
	if (pBtdm8723->curPsTdma != pBtdm8723->psTdmaDuAdjType) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], PsTdma type dismatch!!!, curPsTdma =%d, recordPsTdma =%d\n",
			pBtdm8723->curPsTdma, pBtdm8723->psTdmaDuAdjType));

