torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
		/*  sw mechanism */
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
		    (btRssiState == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntAgcTable(padapter, true);
			btdm_2AntAdcBackOff(padapter, true);
			btdm_2AntDacSwing(padapter, false, 0xc0);
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntAgcTable(padapter, false);
			btdm_2AntAdcBackOff(padapter, false);
			btdm_2AntDacSwing(padapter, false, 0xc0);
		}
	}
}

static void btdm_2Ant8723APANEDRAction(struct rtw_adapter *padapter)
{
	u8 btRssiState, btRssiState1;

	if (btdm_NeedToDecBtPwr(padapter))
		btdm_2AntDecBtPwr(padapter, true);
	else
		btdm_2AntDecBtPwr(padapter, false);

	if (BTDM_IsHT40(padapter)) {
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);

		/*  fw mechanism */
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
		    (btRssiState == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			btdm_2AntPsTdma(padapter, true, 2);
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntPsTdma(padapter, true, 6);
		}

		/*  sw mechanism */
		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, true);
		btdm_2AntDacSwing(padapter, false, 0xc0);
	} else {
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);
		btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		/*  fw mechanism */
		if ((btRssiState1 == BT_RSSI_STATE_HIGH) ||
		    (btRssiState1 == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			btdm_2AntPsTdma(padapter, true, 2);
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			btdm_2AntPsTdma(padapter, true, 6);
		}

		/*  sw mechanism */
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
		    (btRssiState == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntAgcTable(padapter, true);
			btdm_2AntAdcBackOff(padapter, true);
			btdm_2AntDacSwing(padapter, false, 0xc0);
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntAgcTable(padapter, false);
			btdm_2AntAdcBackOff(padapter, false);
			btdm_2AntDacSwing(padapter, false, 0xc0);
		}
	}
}

/* PAN(HS) only */
static void btdm_2Ant8723APANHSAction(struct rtw_adapter *padapter)
{
	u8 btRssiState;

	if (BTDM_IsHT40(padapter)) {
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);
		/*  fw mechanism */
		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
		    (btRssiState == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			btdm_2AntDecBtPwr(padapter, true);
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			btdm_2AntDecBtPwr(padapter, false);
		}
		btdm_2AntPsTdma(padapter, false, 0);

		/*  sw mechanism */
		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, true);
		btdm_2AntDacSwing(padapter, false, 0xc0);
	} else {
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 47, 0);

		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
		    (btRssiState == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high\n"));
			/*  fw mechanism */
			btdm_2AntDecBtPwr(padapter, true);
			btdm_2AntPsTdma(padapter, false, 0);

			/*  sw mechanism */
			btdm_2AntAgcTable(padapter, true);
			btdm_2AntAdcBackOff(padapter, true);
			btdm_2AntDacSwing(padapter, false, 0xc0);
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low\n"));
			/*  fw mechanism */
			btdm_2AntDecBtPwr(padapter, false);
			btdm_2AntPsTdma(padapter, false, 0);

			/*  sw mechanism */
			btdm_2AntAgcTable(padapter, false);
			btdm_2AntAdcBackOff(padapter, false);
			btdm_2AntDacSwing(padapter, false, 0xc0);
		}
	}
}

/* PAN(EDR)+A2DP */
static void btdm_2Ant8723APANEDRA2DPAction(struct rtw_adapter *padapter)
{
	u8 btRssiState, btRssiState1, btInfoExt;
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	btInfoExt = pHalData->bt_coexist.halCoex8723.btInfoExt;

	if (btdm_NeedToDecBtPwr(padapter))
		btdm_2AntDecBtPwr(padapter, true);
	else
		btdm_2AntDecBtPwr(padapter, false);

	if (BTDM_IsHT40(padapter)) {
		RTPRINT(FBT, BT_TRACE, ("HT40\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);

		if ((btRssiState == BT_RSSI_STATE_HIGH) ||
		    (btRssiState == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi high \n"));
			/*  fw mechanism */
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);

			if (btInfoExt&BIT(0)) {	/* a2dp rate, 1:basic /0:edr */
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntPsTdma(padapter, true, 4);
			} else {
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
				btdm_2AntPsTdma(padapter, true, 2);
			}
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi low \n"));
			/*  fw mechanism */
			if (btInfoExt&BIT(0)) {	/* a2dp rate, 1:basic /0:edr */
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntPsTdma(padapter, true, 8);
			} else {
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
				btdm_2AntPsTdma(padapter, true, 6);
			}
		}

		/*  sw mechanism */
		btdm_2AntAgcTable(padapter, false);
		btdm_2AntAdcBackOff(padapter, true);
		btdm_2AntDacSwing(padapter, false, 0xc0);
	} else {
		RTPRINT(FBT, BT_TRACE, ("HT20 or Legacy\n"));
		btRssiState = BTDM_CheckCoexRSSIState(padapter, 2, 37, 0);
		btRssiState1 = BTDM_CheckCoexRSSIState1(padapter, 2, 27, 0);

		if ((btRssiState1 == BT_RSSI_STATE_HIGH) ||
		    (btRssiState1 == BT_RSSI_STATE_STAY_HIGH)) {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 high \n"));
			PlatformEFIOWrite1Byte(padapter, 0x883, 0x40);
			/*  fw mechanism */
			if (btInfoExt&BIT(0)) {	/* a2dp rate, 1:basic /0:edr */
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntPsTdma(padapter, true, 4);
			} else {
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
				btdm_2AntPsTdma(padapter, true, 2);
			}
		} else {
			RTPRINT(FBT, BT_TRACE, ("Wifi rssi-1 low \n"));
			/*  fw mechanism */
			if (btInfoExt&BIT(0)) {	/* a2dp rate, 1:basic /0:edr */
				RTPRINT(FBT, BT_TRACE, ("a2dp basic rate \n"));
				btdm_2AntPsTdma(padapter, true, 8);
			} else {
				RTPRINT(FBT, BT_TRACE, ("a2dp edr rate \n"));
				btdm_2AntPsTdma(padapter, true, 6);
			}
		}

