torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	}
	RTPRINT(FBT, BT_TRACE,
		("[BTC2H], pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage =%x pBtMgnt->ExtConfig.bHoldPeriodCnt =%x pBtMgnt->ExtConfig.bHoldForBtOperation =%x\n",
		pHalData->bt_coexist.halCoex8723.bC2hBtInquiryPage,
		pBtMgnt->ExtConfig.bHoldPeriodCnt,
		pBtMgnt->ExtConfig.bHoldForBtOperation));

	RTPRINT(FBT, BT_TRACE,
		("[BTC2H],   btInfo =%x   pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal =%x\n",
		btInfo, pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal));
	if (btInfo&BT_INFO_ACL) {
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], BTInfo: bConnect = true   btInfo =%x\n", btInfo));
		bBtLinkExist = true;
		if (((btInfo&(BT_INFO_FTP|BT_INFO_A2DP|BT_INFO_HID|BT_INFO_SCO_BUSY)) != 0) ||
		    pHalData->bt_coexist.halCoex8723.btRetryCnt > 0) {
			pBtdm8723->btStatus = BT_2ANT_BT_STATUS_NON_IDLE;
		} else {
			pBtdm8723->btStatus = BT_2ANT_BT_STATUS_CONNECTED_IDLE;
		}

		if (btInfo&BT_INFO_SCO || btInfo&BT_INFO_SCO_BUSY) {
			if (btInfo&BT_INFO_FTP || btInfo&BT_INFO_A2DP || btInfo&BT_INFO_HID) {
				switch (btInfo&0xe0) {
				case BT_INFO_HID:
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + HID\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID;
					break;
				case BT_INFO_A2DP:
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], Error!!! SCO + A2DP\n"));
					break;
				case BT_INFO_FTP:
					if (bBtHsModeExist) {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(HS)\n"));
						algorithm = BT_2ANT_COEX_ALGO_SCO;
					} else {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO + PAN(EDR)\n"));
						algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
					}
					break;
				case (BT_INFO_HID | BT_INFO_A2DP):
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
					break;
				case (BT_INFO_HID | BT_INFO_FTP):
					if (bBtHsModeExist) {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(HS)\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
					} else {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(EDR)\n"));
						algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
					}
					break;
				case (BT_INFO_A2DP | BT_INFO_FTP):
					if (bBtHsModeExist) {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(HS)\n"));
						algorithm = BT_2ANT_COEX_ALGO_A2DP;
					} else {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(EDR)\n"));
						algorithm = BT_2ANT_COEX_ALGO_PANEDR_A2DP;
					}
					break;
				case (BT_INFO_HID | BT_INFO_A2DP | BT_INFO_FTP):
					if (bBtHsModeExist) {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(HS)\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
					} else {
						RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(EDR)\n"));
						algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR;
					}
					break;
				}
			} else {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], SCO only\n"));
				algorithm = BT_2ANT_COEX_ALGO_SCO;
			}
		} else {
			RTPRINT(FBT, BT_TRACE, ("[BTCoex], non SCO\n"));
			switch (btInfo&0xe0) {
			case BT_INFO_HID:
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID;
				break;
			case BT_INFO_A2DP:
				RTPRINT(FBT, BT_TRACE, ("[BTCoex],  A2DP\n"));
				algorithm = BT_2ANT_COEX_ALGO_A2DP;
				break;
			case BT_INFO_FTP:
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], PAN(EDR)\n"));
				algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				break;
			case (BT_INFO_HID | BT_INFO_A2DP):
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP\n"));
				algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
				break;
			case (BT_INFO_HID|BT_INFO_FTP):
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_HID;
				}
				break;
			case (BT_INFO_A2DP|BT_INFO_FTP):
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_A2DP;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], A2DP + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_PANEDR_A2DP;
				}
				break;
			case (BT_INFO_HID|BT_INFO_A2DP|BT_INFO_FTP):
				if (bBtHsModeExist) {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(HS)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP;
				} else {
					RTPRINT(FBT, BT_TRACE, ("[BTCoex], HID + A2DP + PAN(EDR)\n"));
					algorithm = BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR;
				}
				break;
			}

		}
	} else {
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], BTInfo: bConnect = false\n"));
		pBtdm8723->btStatus = BT_2ANT_BT_STATUS_IDLE;
	}

	pBtdm8723->curAlgorithm = algorithm;
	RTPRINT(FBT, BT_TRACE, ("[BTCoex], Algorithm = %d \n", pBtdm8723->curAlgorithm));

/* From */
	BTDM_CheckWiFiState(padapter);
	if (pBtMgnt->ExtConfig.bManualControl) {
		RTPRINT(FBT, BT_TRACE, ("Action Manual control, won't execute bt coexist mechanism!!\n"));
		return;
	}
}

void BTDM_2AntBtCoexist8723A(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	struct bt_dgb *pBtDbg = &pBTInfo->BtDbg;
	u8 btInfoOriginal = 0;
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct btdm_8723a_2ant *pBtdm8723 = &pHalData->bt_coexist.halCoex8723.btdm2Ant;

	if (BTDM_BtProfileSupport(padapter)) {
		if (pBtMgnt->ExtConfig.bHoldForBtOperation) {
			RTPRINT(FBT, BT_TRACE, ("Action for BT Operation adjust!!\n"));
			return;
		}
		if (pBtMgnt->ExtConfig.bHoldPeriodCnt) {
			RTPRINT(FBT, BT_TRACE, ("Hold BT inquiry/page scan setting (cnt = %d)!!\n",
				pBtMgnt->ExtConfig.bHoldPeriodCnt));
			if (pBtMgnt->ExtConfig.bHoldPeriodCnt >= 11) {
				pBtMgnt->ExtConfig.bHoldPeriodCnt = 0;
				/*  next time the coexist parameters should be reset again. */
			} else {
				pBtMgnt->ExtConfig.bHoldPeriodCnt++;
			}
			return;
		}

		if (pBtDbg->dbgCtrl)
			RTPRINT(FBT, BT_TRACE, ("[Dbg control], "));

		pBtdm8723->curAlgorithm = btdm_ActionAlgorithm(padapter);
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Algorithm = %d \n", pBtdm8723->curAlgorithm));

		if (btdm_Is2Ant8723ACommonAction(padapter)) {
			RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			pBtdm8723->bResetTdmaAdjust = true;
		} else {
			if (pBtdm8723->curAlgorithm != pBtdm8723->preAlgorithm) {
				RTPRINT(FBT, BT_TRACE, ("[BTCoex], preAlgorithm =%d, curAlgorithm =%d\n",
				pBtdm8723->preAlgorithm, pBtdm8723->curAlgorithm));
				pBtdm8723->bResetTdmaAdjust = true;
			}
			switch (pBtdm8723->curAlgorithm) {
			case BT_2ANT_COEX_ALGO_SCO:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = SCO.\n"));
				btdm_2Ant8723ASCOAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_HID:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID.\n"));
				btdm_2Ant8723AHIDAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_A2DP:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = A2DP.\n"));
				btdm_2Ant8723AA2DPAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANEDR:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR).\n"));
				btdm_2Ant8723APANEDRAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANHS:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HS mode.\n"));
				btdm_2Ant8723APANHSAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANEDR_A2DP:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN+A2DP.\n"));
				btdm_2Ant8723APANEDRA2DPAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANEDR_HID:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR)+HID.\n"));
				btdm_2Ant8723APANEDRHIDAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP+PAN.\n"));
				btdm_2Ant8723AHIDA2DPPANEDRAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_HID_A2DP:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP.\n"));
				btdm_2Ant8723AHIDA2DPAction(padapter);
				break;
			default:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = 0.\n"));
				btdm_2Ant8723AA2DPAction(padapter);
				break;
			}
			pBtdm8723->preAlgorithm = pBtdm8723->curAlgorithm;
		}
	} else {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex] Get bt info by fw!!\n"));
		/* msg shows c2h rsp for bt_info is received or not. */
		if (pHalData->bt_coexist.halCoex8723.bC2hBtInfoReqSent)
			RTPRINT(FBT, BT_TRACE, ("[BTCoex] c2h for btInfo not rcvd yet!!\n"));

		btInfoOriginal = pHalData->bt_coexist.halCoex8723.c2hBtInfoOriginal;

		if (pBtMgnt->ExtConfig.bHoldForBtOperation) {
			RTPRINT(FBT, BT_TRACE, ("Action for BT Operation adjust!!\n"));
			return;
		}
		if (pBtMgnt->ExtConfig.bHoldPeriodCnt) {
			RTPRINT(FBT, BT_TRACE,
				("Hold BT inquiry/page scan setting (cnt = %d)!!\n",
				pBtMgnt->ExtConfig.bHoldPeriodCnt));
			if (pBtMgnt->ExtConfig.bHoldPeriodCnt >= 11) {
				pBtMgnt->ExtConfig.bHoldPeriodCnt = 0;
				/*  next time the coexist parameters should be reset again. */
			} else {
				 pBtMgnt->ExtConfig.bHoldPeriodCnt++;
			}
			return;
		}

		if (pBtDbg->dbgCtrl)
			RTPRINT(FBT, BT_TRACE, ("[Dbg control], "));
		if (btdm_Is2Ant8723ACommonAction(padapter)) {
			RTPRINT(FBT, BT_TRACE, ("Action 2-Ant common.\n"));
			pBtdm8723->bResetTdmaAdjust = true;
		} else {
			if (pBtdm8723->curAlgorithm != pBtdm8723->preAlgorithm) {
				RTPRINT(FBT, BT_TRACE,
					("[BTCoex], preAlgorithm =%d, curAlgorithm =%d\n",
					pBtdm8723->preAlgorithm,
					pBtdm8723->curAlgorithm));
				pBtdm8723->bResetTdmaAdjust = true;
			}
			switch (pBtdm8723->curAlgorithm) {
			case BT_2ANT_COEX_ALGO_SCO:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = SCO.\n"));
				btdm_2Ant8723ASCOAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_HID:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID.\n"));
				btdm_2Ant8723AHIDAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_A2DP:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = A2DP.\n"));
				btdm_2Ant8723AA2dp(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANEDR:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR).\n"));
				btdm_2Ant8723APANEDRAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANHS:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HS mode.\n"));
				btdm_2Ant8723APANHSAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANEDR_A2DP:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN+A2DP.\n"));
				btdm_2Ant8723APANEDRA2DPAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_PANEDR_HID:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = PAN(EDR)+HID.\n"));
				btdm_2Ant8723APANEDRHIDAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_HID_A2DP_PANEDR:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP+PAN.\n"));
				btdm_2Ant8723AHIDA2DPPANEDRAction(padapter);
				break;
			case BT_2ANT_COEX_ALGO_HID_A2DP:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = HID+A2DP.\n"));
				btdm_2Ant8723AHIDA2DPAction(padapter);
				break;
			default:
				RTPRINT(FBT, BT_TRACE, ("Action 2-Ant, algorithm = 0.\n"));
				btdm_2Ant8723AA2DPAction(padapter);
				break;
			}
			pBtdm8723->preAlgorithm = pBtdm8723->curAlgorithm;
		}
	}
}

