torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
/*  ===== End of sync from SD7 driver HAL/BTCoexist/HalBtc87232Ant.c ===== */
#endif

#ifdef __HALBTC8723_C__ /*  HAL/BTCoexist/HalBtc8723.c */
/*  ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtc8723.c ===== */

static u8 btCoexDbgBuf[BT_TMP_BUF_SIZE];

static const char *const BtProfileString[] = {
	"NONE",
	"A2DP",
	"PAN",
	"HID",
	"SCO",
};

static const char *const BtSpecString[] = {
	"1.0b",
	"1.1",
	"1.2",
	"2.0+EDR",
	"2.1+EDR",
	"3.0+HS",
	"4.0",
};

static const char *const BtLinkRoleString[] = {
	"Master",
	"Slave",
};

static u8 btdm_BtWifiAntNum(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct bt_coexist_8723a *pBtCoex = &pHalData->bt_coexist.halCoex8723;

	if (Ant_x2 == pHalData->bt_coexist.BT_Ant_Num) {
		if (Ant_x2 == pBtCoex->TotalAntNum)
			return Ant_x2;
		else
			return Ant_x1;
	} else {
		return Ant_x1;
	}
	return Ant_x2;
}

static void btdm_BtHwCountersMonitor(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u32	regHPTxRx, regLPTxRx, u4Tmp;
	u32	regHPTx = 0, regHPRx = 0, regLPTx = 0, regLPRx = 0;

	regHPTxRx = REG_HIGH_PRIORITY_TXRX;
	regLPTxRx = REG_LOW_PRIORITY_TXRX;

	u4Tmp = rtw_read32(padapter, regHPTxRx);
	regHPTx = u4Tmp & bMaskLWord;
	regHPRx = (u4Tmp & bMaskHWord)>>16;

	u4Tmp = rtw_read32(padapter, regLPTxRx);
	regLPTx = u4Tmp & bMaskLWord;
	regLPRx = (u4Tmp & bMaskHWord)>>16;

	pHalData->bt_coexist.halCoex8723.highPriorityTx = regHPTx;
	pHalData->bt_coexist.halCoex8723.highPriorityRx = regHPRx;
	pHalData->bt_coexist.halCoex8723.lowPriorityTx = regLPTx;
	pHalData->bt_coexist.halCoex8723.lowPriorityRx = regLPRx;

	RTPRINT(FBT, BT_TRACE, ("High Priority Tx/Rx = %d / %d\n", regHPTx, regHPRx));
	RTPRINT(FBT, BT_TRACE, ("Low Priority Tx/Rx = %d / %d\n", regLPTx, regLPRx));

	/*  reset counter */
	rtw_write8(padapter, 0x76e, 0xc);
}

/*  This function check if 8723 bt is disabled */
static void btdm_BtEnableDisableCheck8723A(struct rtw_adapter *padapter)
{
	u8 btAlife = true;
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

#ifdef CHECK_BT_EXIST_FROM_REG
	u8 val8;

	/*  ox68[28]= 1 => BT enable; otherwise disable */
	val8 = rtw_read8(padapter, 0x6B);
	if (!(val8 & BIT(4)))
		btAlife = false;

	if (btAlife)
		pHalData->bt_coexist.bCurBtDisabled = false;
	else
		pHalData->bt_coexist.bCurBtDisabled = true;
#else
	if (pHalData->bt_coexist.halCoex8723.highPriorityTx == 0 &&
	    pHalData->bt_coexist.halCoex8723.highPriorityRx == 0 &&
	    pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0 &&
	    pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0)
		btAlife = false;
	if (pHalData->bt_coexist.halCoex8723.highPriorityTx == 0xeaea &&
	    pHalData->bt_coexist.halCoex8723.highPriorityRx == 0xeaea &&
	    pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0xeaea &&
	    pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0xeaea)
		btAlife = false;
	if (pHalData->bt_coexist.halCoex8723.highPriorityTx == 0xffff &&
	    pHalData->bt_coexist.halCoex8723.highPriorityRx == 0xffff &&
	    pHalData->bt_coexist.halCoex8723.lowPriorityTx == 0xffff &&
	    pHalData->bt_coexist.halCoex8723.lowPriorityRx == 0xffff)
		btAlife = false;
	if (btAlife) {
		pHalData->bt_coexist.btActiveZeroCnt = 0;
		pHalData->bt_coexist.bCurBtDisabled = false;
		RTPRINT(FBT, BT_TRACE, ("8723A BT is enabled !!\n"));
	} else {
		pHalData->bt_coexist.btActiveZeroCnt++;
		RTPRINT(FBT, BT_TRACE, ("8723A bt all counters = 0, %d times!!\n",
				pHalData->bt_coexist.btActiveZeroCnt));
		if (pHalData->bt_coexist.btActiveZeroCnt >= 2) {
			pHalData->bt_coexist.bCurBtDisabled = true;
			RTPRINT(FBT, BT_TRACE, ("8723A BT is disabled !!\n"));
		}
	}
#endif

	if (!pHalData->bt_coexist.bCurBtDisabled) {
		if (BTDM_IsWifiConnectionExist(padapter))
			BTDM_SetFwChnlInfo(padapter, RT_MEDIA_CONNECT);
		else
			BTDM_SetFwChnlInfo(padapter, RT_MEDIA_DISCONNECT);
	}

	if (pHalData->bt_coexist.bPreBtDisabled !=
	    pHalData->bt_coexist.bCurBtDisabled) {
		RTPRINT(FBT, BT_TRACE, ("8723A BT is from %s to %s!!\n",
			(pHalData->bt_coexist.bPreBtDisabled ? "disabled":"enabled"),
			(pHalData->bt_coexist.bCurBtDisabled ? "disabled":"enabled")));
		pHalData->bt_coexist.bPreBtDisabled = pHalData->bt_coexist.bCurBtDisabled;
	}
}

static void btdm_BTCoexist8723AHandler(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;

	pHalData = GET_HAL_DATA(padapter);

	if (btdm_BtWifiAntNum(padapter) == Ant_x2) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 2 Ant mechanism\n"));
		BTDM_2AntBtCoexist8723A(padapter);
	} else {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], 1 Ant mechanism\n"));
		BTDM_1AntBtCoexist8723A(padapter);
	}

	if (!BTDM_IsSameCoexistState(padapter)) {
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], Coexist State[bitMap] change from 0x%"i64fmt"x to 0x%"i64fmt"x\n",
			pHalData->bt_coexist.PreviousState,
			pHalData->bt_coexist.CurrentState));
		pHalData->bt_coexist.PreviousState = pHalData->bt_coexist.CurrentState;

		RTPRINT(FBT, BT_TRACE, ("["));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT30)
			RTPRINT(FBT, BT_TRACE, ("BT 3.0, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT20)
			RTPRINT(FBT, BT_TRACE, ("HT20, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_HT40)
			RTPRINT(FBT, BT_TRACE, ("HT40, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_LEGACY)
			RTPRINT(FBT, BT_TRACE, ("Legacy, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_LOW)
			RTPRINT(FBT, BT_TRACE, ("Rssi_Low, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_MEDIUM)
			RTPRINT(FBT, BT_TRACE, ("Rssi_Mid, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_RSSI_HIGH)
			RTPRINT(FBT, BT_TRACE, ("Rssi_High, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_IDLE)
			RTPRINT(FBT, BT_TRACE, ("Wifi_Idle, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_UPLINK)
			RTPRINT(FBT, BT_TRACE, ("Wifi_Uplink, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_WIFI_DOWNLINK)
			RTPRINT(FBT, BT_TRACE, ("Wifi_Downlink, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_IDLE)
			RTPRINT(FBT, BT_TRACE, ("BT_idle, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_HID)
			RTPRINT(FBT, BT_TRACE, ("PRO_HID, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_A2DP)
			RTPRINT(FBT, BT_TRACE, ("PRO_A2DP, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_PAN)
			RTPRINT(FBT, BT_TRACE, ("PRO_PAN, "));
		if (pHalData->bt_coexist.CurrentState & BT_COEX_STATE_PROFILE_SCO)
			RTPRINT(FBT, BT_TRACE, ("PRO_SCO, "));
		RTPRINT(FBT, BT_TRACE, ("]\n"));
	}
}

/*  extern function start with BTDM_ */
u32 BTDM_BtTxRxCounterH(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u32	counters = 0;

	counters = pHalData->bt_coexist.halCoex8723.highPriorityTx+
		pHalData->bt_coexist.halCoex8723.highPriorityRx;
	return counters;
}

u32 BTDM_BtTxRxCounterL(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u32	counters = 0;

	counters = pHalData->bt_coexist.halCoex8723.lowPriorityTx+
		pHalData->bt_coexist.halCoex8723.lowPriorityRx ;
	return counters;
}

void BTDM_SetFwChnlInfo(struct rtw_adapter *padapter, enum rt_media_status mstatus)
{
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	u8 H2C_Parameter[3] = {0};
	u8 chnl;

	/*  opMode */
	if (RT_MEDIA_CONNECT == mstatus)
		H2C_Parameter[0] = 0x1;	/*  0: disconnected, 1:connected */

	if (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE)) {
		/*  channel */
		chnl = pmlmeext->cur_channel;
		if (BTDM_IsHT40(padapter)) {
			if (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_UPPER)
				chnl -= 2;
			else if (pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_LOWER)
				chnl += 2;
		}
		H2C_Parameter[1] = chnl;
	} else {	/*  check if HS link is exists */
		/*  channel */
		if (BT_Operation(padapter))
			H2C_Parameter[1] = pBtMgnt->BTChannel;
		else
			H2C_Parameter[1] = pmlmeext->cur_channel;
	}

	if (BTDM_IsHT40(padapter))
		H2C_Parameter[2] = 0x30;
	else
		H2C_Parameter[2] = 0x20;

	FillH2CCmd(padapter, 0x19, 3, H2C_Parameter);
}

u8 BTDM_IsWifiConnectionExist(struct rtw_adapter *padapter)
{
	u8 bRet = false;

