torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	if (BTHCI_HsConnectionEstablished(padapter))
		bRet = true;

	if (check_fwstate(&padapter->mlmepriv, WIFI_ASOC_STATE) == true)
		bRet = true;

	return bRet;
}

void BTDM_SetFw3a(
	struct rtw_adapter *padapter,
	u8 byte1,
	u8 byte2,
	u8 byte3,
	u8 byte4,
	u8 byte5
	)
{
	u8 H2C_Parameter[5] = {0};

	if (BTDM_1Ant8723A(padapter)) {
		if ((!check_fwstate(&padapter->mlmepriv, WIFI_STATION_STATE)) &&
		    (get_fwstate(&padapter->mlmepriv) != WIFI_NULL_STATE)) {
			/*  for softap mode */
			struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
			struct bt_coexist_8723a *pBtCoex = &pHalData->bt_coexist.halCoex8723;
			u8 BtState = pBtCoex->c2hBtInfo;

			if ((BtState != BT_INFO_STATE_NO_CONNECTION) &&
			    (BtState != BT_INFO_STATE_CONNECT_IDLE)) {
				if (byte1 & BIT(4)) {
					byte1 &= ~BIT(4);
					byte1 |= BIT(5);
				}

				byte5 |= BIT(5);
				if (byte5 & BIT(6))
					byte5 &= ~BIT(6);
			}
		}
	}

	H2C_Parameter[0] = byte1;
	H2C_Parameter[1] = byte2;
	H2C_Parameter[2] = byte3;
	H2C_Parameter[3] = byte4;
	H2C_Parameter[4] = byte5;

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], FW write 0x3a(5bytes) = 0x%02x%08x\n",
		H2C_Parameter[0],
		H2C_Parameter[1]<<24|H2C_Parameter[2]<<16|H2C_Parameter[3]<<8|H2C_Parameter[4]));

	FillH2CCmd(padapter, 0x3a, 5, H2C_Parameter);
}

void BTDM_QueryBtInformation(struct rtw_adapter *padapter)
{
	u8 H2C_Parameter[1] = {0};
	struct hal_data_8723a *pHalData;
	struct bt_coexist_8723a *pBtCoex;

	pHalData = GET_HAL_DATA(padapter);
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	if (BT_IsBtDisabled(padapter)) {
		pBtCoex->c2hBtInfo = BT_INFO_STATE_DISABLED;
		pBtCoex->bC2hBtInfoReqSent = false;
		return;
	}

	if (pBtCoex->c2hBtInfo == BT_INFO_STATE_DISABLED)
		pBtCoex->c2hBtInfo = BT_INFO_STATE_NO_CONNECTION;

	if (pBtCoex->bC2hBtInfoReqSent == true)
		RTPRINT(FBT, BT_TRACE, ("[BTCoex], didn't recv previous BtInfo report!\n"));
	else
		pBtCoex->bC2hBtInfoReqSent = true;

	H2C_Parameter[0] |= BIT(0);	/*  trigger */

/*RTPRINT(FBT, BT_TRACE, ("[BTCoex], Query Bt information, write 0x38 = 0x%x\n", */
/*H2C_Parameter[0])); */

	FillH2CCmd(padapter, 0x38, 1, H2C_Parameter);
}

void BTDM_SetSwRfRxLpfCorner(struct rtw_adapter *padapter, u8 type)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (BT_RF_RX_LPF_CORNER_SHRINK == type) {
		/* Shrink RF Rx LPF corner */
		RTPRINT(FBT, BT_TRACE, ("Shrink RF Rx LPF corner!!\n"));
		PHY_SetRFReg(padapter, PathA, 0x1e, bRFRegOffsetMask, 0xf0ff7);
		pHalData->bt_coexist.bSWCoexistAllOff = false;
	} else if (BT_RF_RX_LPF_CORNER_RESUME == type) {
		/* Resume RF Rx LPF corner */
		RTPRINT(FBT, BT_TRACE, ("Resume RF Rx LPF corner!!\n"));
		PHY_SetRFReg(padapter, PathA, 0x1e, bRFRegOffsetMask, pHalData->bt_coexist.BtRfRegOrigin1E);
	}
}

void
BTDM_SetSwPenaltyTxRateAdaptive(
	struct rtw_adapter *padapter,
	u8 raType
	)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u8 tmpU1;

	tmpU1 = rtw_read8(padapter, 0x4fd);
	tmpU1 |= BIT(0);
	if (BT_TX_RATE_ADAPTIVE_LOW_PENALTY == raType) {
		tmpU1 &= ~BIT(2);
		pHalData->bt_coexist.bSWCoexistAllOff = false;
	} else if (BT_TX_RATE_ADAPTIVE_NORMAL == raType) {
		tmpU1 |= BIT(2);
	}

	rtw_write8(padapter, 0x4fd, tmpU1);
}

void BTDM_SetFwDecBtPwr(struct rtw_adapter *padapter, u8 bDecBtPwr)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u8 H2C_Parameter[1] = {0};

	H2C_Parameter[0] = 0;

	if (bDecBtPwr) {
		H2C_Parameter[0] |= BIT(1);
		pHalData->bt_coexist.bFWCoexistAllOff = false;
	}

	RTPRINT(FBT, BT_TRACE, ("[BTCoex], decrease Bt Power : %s, write 0x21 = 0x%x\n",
		(bDecBtPwr ? "Yes!!" : "No!!"), H2C_Parameter[0]));

	FillH2CCmd(padapter, 0x21, 1, H2C_Parameter);
}

u8 BTDM_BtProfileSupport(struct rtw_adapter *padapter)
{
	u8 bRet = false;
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (pBtMgnt->bSupportProfile &&
	    !pHalData->bt_coexist.halCoex8723.bForceFwBtInfo)
		bRet = true;

	return bRet;
}

static void BTDM_AdjustForBtOperation8723A(struct rtw_adapter *padapter)
{
	/* BTDM_2AntAdjustForBtOperation8723(padapter); */
}

static void BTDM_FwC2hBtRssi8723A(struct rtw_adapter *padapter, u8 *tmpBuf)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u8 percent = 0, u1tmp = 0;

	u1tmp = tmpBuf[0];
	percent = u1tmp*2+10;

	pHalData->bt_coexist.halCoex8723.btRssi = percent;
/*RTPRINT(FBT, BT_TRACE, ("[BTC2H], BT RSSI =%d\n", percent)); */
}

static void
BTDM_FwC2hBtInfo8723A(struct rtw_adapter *padapter, u8 *tmpBuf, u8 length)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_coexist_8723a *pBtCoex;
	u8 i;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtCoex = &pHalData->bt_coexist.halCoex8723;

	pBtCoex->bC2hBtInfoReqSent = false;

	RTPRINT(FBT, BT_TRACE, ("[BTC2H], BT info[%d]=[", length));

	pBtCoex->btRetryCnt = 0;
	for (i = 0; i < length; i++) {
		switch (i) {
		case 0:
			pBtCoex->c2hBtInfoOriginal = tmpBuf[i];
			break;
		case 1:
			pBtCoex->btRetryCnt = tmpBuf[i];
			break;
		case 2:
			BTDM_FwC2hBtRssi8723A(padapter, &tmpBuf[i]);
			break;
		case 3:
			pBtCoex->btInfoExt = tmpBuf[i]&BIT(0);
			break;
		}

		if (i == length-1)
			RTPRINT(FBT, BT_TRACE, ("0x%02x]\n", tmpBuf[i]));
		else
			RTPRINT(FBT, BT_TRACE, ("0x%02x, ", tmpBuf[i]));
	}
	RTPRINT(FBT, BT_TRACE, ("[BTC2H], BT RSSI =%d\n", pBtCoex->btRssi));
	if (pBtCoex->btInfoExt)
		RTPRINT(FBT, BT_TRACE, ("[BTC2H], pBtCoex->btInfoExt =%x\n", pBtCoex->btInfoExt));

	if (btdm_BtWifiAntNum(padapter) == Ant_x1)
		BTDM_1AntFwC2hBtInfo8723A(padapter);
	else
		BTDM_2AntFwC2hBtInfo8723A(padapter);

	if (pBtMgnt->ExtConfig.bManualControl) {
		RTPRINT(FBT, BT_TRACE, ("%s: Action Manual control!!\n", __func__));
		return;
	}

	btdm_BTCoexist8723AHandler(padapter);
}

static void BTDM_Display8723ABtCoexInfo(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct bt_coexist_8723a *pBtCoex = &pHalData->bt_coexist.halCoex8723;
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	u8 u1Tmp, u1Tmp1, u1Tmp2, i, btInfoExt, psTdmaCase = 0;
	u32 u4Tmp[4];
	u8 antNum = Ant_x2;

	rsprintf(btCoexDbgBuf, BT_TMP_BUF_SIZE, "\r\n ============[BT Coexist info]============");
	DCMD_Printf(btCoexDbgBuf);

