torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x1)
		return;

	H2C_Parameter[2] = 0;
	H2C_Parameter[1] = 0;
	H2C_Parameter[0] = 0;

	if (bInterruptOn) {
		H2C_Parameter[2] |= 0x02;	/* BIT1 */
		pHalData->bt_coexist.bFWCoexistAllOff = false;
	}
	pHalData->bt_coexist.bInterruptOn = bInterruptOn;

	if (bSingleAntOn) {
		H2C_Parameter[2] |= 0x10;	/* BIT4 */
		pHalData->bt_coexist.bFWCoexistAllOff = false;
	}
	pHalData->bt_coexist.bSingleAntOn = bSingleAntOn;

	if (bMultiNAVOn) {
		H2C_Parameter[2] |= 0x20;	/* BIT5 */
		pHalData->bt_coexist.bFWCoexistAllOff = false;
	}
	pHalData->bt_coexist.bMultiNAVOn = bMultiNAVOn;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], SingleAntenna =[%s:%s:%s], write 0xe = 0x%x\n",
		bSingleAntOn?"ON":"OFF", bInterruptOn?"ON":"OFF", bMultiNAVOn?"ON":"OFF",
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));
}

void BTDM_CheckBTIdleChange1Ant(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo = GET_BT_INFO(padapter);
	struct bt_mgnt *pBtMgnt = &pBTInfo->BtMgnt;
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
/*PMGNT_INFO		pMgntInfo = &padapter->MgntInfo; */
	u8 	stateChange = false;
	u32			BT_Polling, Ratio_Act, Ratio_STA;
	u32				BT_Active, BT_State;
	u32				regBTActive = 0, regBTState = 0, regBTPolling = 0;

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;
	if (pBtMgnt->ExtConfig.bManualControl)
		return;
	if (pHalData->bt_coexist.BT_CoexistType != BT_CSR_BC8)
		return;
	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x1)
		return;

	/*  The following we only consider CSR BC8 and fw version should be >= 62 */
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], FirmwareVersion = 0x%x(%d)\n",
	pHalData->FirmwareVersion, pHalData->FirmwareVersion));
	regBTActive = REG_BT_ACTIVE;
	regBTState = REG_BT_STATE;
	if (pHalData->FirmwareVersion >= FW_VER_BT_REG1)
		regBTPolling = REG_BT_POLLING1;
	else
		regBTPolling = REG_BT_POLLING;

	BT_Active = rtw_read32(padapter, regBTActive);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_Active(0x%x) =%x\n", regBTActive, BT_Active));
	BT_Active = BT_Active & 0x00ffffff;

	BT_State = rtw_read32(padapter, regBTState);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_State(0x%x) =%x\n", regBTState, BT_State));
	BT_State = BT_State & 0x00ffffff;

	BT_Polling = rtw_read32(padapter, regBTPolling);
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT_Polling(0x%x) =%x\n", regBTPolling, BT_Polling));

	if (BT_Active == 0xffffffff && BT_State == 0xffffffff && BT_Polling == 0xffffffff)
		return;
	if (BT_Polling == 0)
		return;

	Ratio_Act = BT_Active*1000/BT_Polling;
	Ratio_STA = BT_State*1000/BT_Polling;

	pHalData->bt_coexist.Ratio_Tx = Ratio_Act;
	pHalData->bt_coexist.Ratio_PRI = Ratio_STA;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Ratio_Act =%d\n", Ratio_Act));
	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Ratio_STA =%d\n", Ratio_STA));

	if (Ratio_STA < 60 && Ratio_Act < 500) {	/*  BT PAN idle */
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_IDLE;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
	} else {
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_IDLE;

		if (Ratio_STA) {
			/*  Check if BT PAN (under BT 2.1) is uplink or downlink */
			if ((Ratio_Act/Ratio_STA) < 2) {
				/*  BT PAN Uplink */
				pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = true;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_UPLINK;
				pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = false;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_DOWNLINK;
			} else {
				/*  BT PAN downlink */
				pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = false;
				pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
				pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = true;
				pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_DOWNLINK;
			}
		} else {
			/*  BT PAN downlink */
			pHalData->bt_coexist.BT21TrafficStatistics.bTxBusyTraffic = false;
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_PAN_UPLINK;
			pHalData->bt_coexist.BT21TrafficStatistics.bRxBusyTraffic = true;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_PAN_DOWNLINK;
		}
	}

	/*  Check BT is idle or not */
	if (pBtMgnt->ExtConfig.NumberOfHandle == 0 &&
	    pBtMgnt->ExtConfig.NumberOfSCO == 0) {
		pBtMgnt->ExtConfig.bBTBusy = false;
		pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
	} else {
		if (Ratio_STA < 60) {
			pBtMgnt->ExtConfig.bBTBusy = false;
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_IDLE;
		} else {
			pBtMgnt->ExtConfig.bBTBusy = true;
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_IDLE;
		}
	}

	if (pBtMgnt->ExtConfig.NumberOfHandle == 0 &&
	    pBtMgnt->ExtConfig.NumberOfSCO == 0) {
		pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_RSSI_LOW;
		pBtMgnt->ExtConfig.MIN_BT_RSSI = 0;
		BTDM_SetAntenna(padapter, BTDM_ANT_BT_IDLE);
	} else {
		if (pBtMgnt->ExtConfig.MIN_BT_RSSI <= -5) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_BT_RSSI_LOW;
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], core stack notify bt rssi Low\n"));
		} else {
			pHalData->bt_coexist.CurrentState &= ~BT_COEX_STATE_BT_RSSI_LOW;
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], core stack notify bt rssi Normal\n"));
		}
	}

	if (pHalData->bt_coexist.bBTBusyTraffic != pBtMgnt->ExtConfig.bBTBusy) {
		/*  BT idle or BT non-idle */
		pHalData->bt_coexist.bBTBusyTraffic = pBtMgnt->ExtConfig.bBTBusy;
		stateChange = true;
	}

	if (stateChange) {
		if (!pBtMgnt->ExtConfig.bBTBusy)
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT is idle or disable\n"));
		else
			RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT is non-idle\n"));
	}
	if (!pBtMgnt->ExtConfig.bBTBusy) {
		RTPRINT(FBT, BT_TRACE, ("[DM][BT], BT is idle or disable\n"));
		if (check_fwstate(&padapter->mlmepriv, WIFI_UNDER_LINKING|WIFI_SITE_MONITOR) == true)
			BTDM_SetAntenna(padapter, BTDM_ANT_WIFI);
	}
}

/*  ===== End of sync from SD7 driver HAL/BTCoexist/HalBtcCsr1Ant.c ===== */
#endif

#ifdef __HALBTCCSR2ANT_C__ /*  HAL/BTCoexist/HalBtcCsr2Ant.c */
/*  ===== Below this line is sync from SD7 driver HAL/BTCoexist/HalBtcCsr2Ant.c ===== */

/*  local function start with btdm_ */

/*  Note: */
/*  In the following, FW should be done before SW mechanism. */
/*  BTDM_Balance(), BTDM_DiminishWiFi(), BT_NAV() should be done */
/*  before BTDM_AGCTable(), BTDM_BBBackOffLevel(), btdm_DacSwing(). */

/*  extern function start with BTDM_ */

void
BTDM_DiminishWiFi(
	struct rtw_adapter *padapter,
	u8 bDACOn,
	u8 bInterruptOn,
	u8 DACSwingLevel,
	u8 bNAVOn
	)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u8 H2C_Parameter[3] = {0};

	if (pHalData->bt_coexist.BT_Ant_Num != Ant_x2)
		return;

