torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
u8 BTDM_DisableEDCATurbo(struct rtw_adapter *padapter)
{
	struct bt_mgnt *pBtMgnt;
	struct hal_data_8723a *pHalData;
	u8 bBtChangeEDCA = false;
	u32 EDCA_BT_BE = 0x5ea42b, cur_EDCA_reg;
	u8 bRet = false;

	pHalData = GET_HAL_DATA(padapter);
	pBtMgnt = &pHalData->BtInfo.BtMgnt;

	if (!pHalData->bt_coexist.BluetoothCoexist) {
		bRet = false;
		pHalData->bt_coexist.lastBtEdca = 0;
		return bRet;
	}
	if (!((pBtMgnt->bSupportProfile) ||
	    (pHalData->bt_coexist.BT_CoexistType == BT_CSR_BC8))) {
		bRet = false;
		pHalData->bt_coexist.lastBtEdca = 0;
		return bRet;
	}

	if (BT_1Ant(padapter)) {
		bRet = false;
		pHalData->bt_coexist.lastBtEdca = 0;
		return bRet;
	}

	if (pHalData->bt_coexist.exec_cnt < 3)
		pHalData->bt_coexist.exec_cnt++;
	else
		pHalData->bt_coexist.bEDCAInitialized = true;

	/*  When BT is non idle */
	if (!(pHalData->bt_coexist.CurrentState & BT_COEX_STATE_BT_IDLE)) {
		RTPRINT(FBT, BT_TRACE, ("BT state non idle, set bt EDCA\n"));

		/* aggr_num = 0x0909; */
		if (pHalData->odmpriv.DM_EDCA_Table.bCurrentTurboEDCA) {
			bBtChangeEDCA = true;
			pHalData->odmpriv.DM_EDCA_Table.bCurrentTurboEDCA = false;
			pHalData->dmpriv.prv_traffic_idx = 3;
		}
		cur_EDCA_reg = rtw_read32(padapter, REG_EDCA_BE_PARAM);

		if (cur_EDCA_reg != EDCA_BT_BE)
			bBtChangeEDCA = true;
		if (bBtChangeEDCA || !pHalData->bt_coexist.bEDCAInitialized) {
			rtw_write32(padapter, REG_EDCA_BE_PARAM, EDCA_BT_BE);
			pHalData->bt_coexist.lastBtEdca = EDCA_BT_BE;
		}
		bRet = true;
	} else {
		RTPRINT(FBT, BT_TRACE, ("BT state idle, set original EDCA\n"));
		pHalData->bt_coexist.lastBtEdca = 0;
		bRet = false;
	}
	return bRet;
}

void
BTDM_Balance(
	struct rtw_adapter *padapter,
	u8 bBalanceOn,
	u8 ms0,
	u8 ms1
	)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	u8 H2C_Parameter[3] = {0};

	if (bBalanceOn) {
		H2C_Parameter[2] = 1;
		H2C_Parameter[1] = ms1;
		H2C_Parameter[0] = ms0;
		pHalData->bt_coexist.bFWCoexistAllOff = false;
	} else {
		H2C_Parameter[2] = 0;
		H2C_Parameter[1] = 0;
		H2C_Parameter[0] = 0;
	}
	pHalData->bt_coexist.bBalanceOn = bBalanceOn;

	RTPRINT(FBT, BT_TRACE, ("[DM][BT], Balance =[%s:%dms:%dms], write 0xc = 0x%x\n",
		bBalanceOn?"ON":"OFF", ms0, ms1,
		H2C_Parameter[0]<<16|H2C_Parameter[1]<<8|H2C_Parameter[2]));

	FillH2CCmd(padapter, 0xc, 3, H2C_Parameter);
}

void BTDM_AGCTable(struct rtw_adapter *padapter, u8 type)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	if (type == BT_AGCTABLE_OFF) {
		RTPRINT(FBT, BT_TRACE, ("[BT]AGCTable Off!\n"));
		rtw_write32(padapter, 0xc78, 0x641c0001);
		rtw_write32(padapter, 0xc78, 0x631d0001);
		rtw_write32(padapter, 0xc78, 0x621e0001);
		rtw_write32(padapter, 0xc78, 0x611f0001);
		rtw_write32(padapter, 0xc78, 0x60200001);

		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x32000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x71000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xb0000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xfc000);
		PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x30355);

		pHalData->bt_coexist.b8723aAgcTableOn = false;
	} else if (type == BT_AGCTABLE_ON) {
		RTPRINT(FBT, BT_TRACE, ("[BT]AGCTable On!\n"));
		rtw_write32(padapter, 0xc78, 0x4e1c0001);
		rtw_write32(padapter, 0xc78, 0x4d1d0001);
		rtw_write32(padapter, 0xc78, 0x4c1e0001);
		rtw_write32(padapter, 0xc78, 0x4b1f0001);
		rtw_write32(padapter, 0xc78, 0x4a200001);

		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0xdc000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x90000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x51000);
		PHY_SetRFReg(padapter, PathA, RF_RX_AGC_HP, bRFRegOffsetMask, 0x12000);
		PHY_SetRFReg(padapter, PathA, RF_RX_G1, bRFRegOffsetMask, 0x00355);

		pHalData->bt_coexist.b8723aAgcTableOn = true;

		pHalData->bt_coexist.bSWCoexistAllOff = false;
	}
}

void BTDM_BBBackOffLevel(struct rtw_adapter *padapter, u8 type)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (type == BT_BB_BACKOFF_OFF) {
		RTPRINT(FBT, BT_TRACE, ("[BT]BBBackOffLevel Off!\n"));
		rtw_write32(padapter, 0xc04, 0x3a05611);
	} else if (type == BT_BB_BACKOFF_ON) {
		RTPRINT(FBT, BT_TRACE, ("[BT]BBBackOffLevel On!\n"));
		rtw_write32(padapter, 0xc04, 0x3a07611);
		pHalData->bt_coexist.bSWCoexistAllOff = false;
	}
}

void BTDM_FWCoexAllOff(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);;

	RTPRINT(FBT, BT_TRACE, ("BTDM_FWCoexAllOff()\n"));
	if (pHalData->bt_coexist.bFWCoexistAllOff)
		return;
	RTPRINT(FBT, BT_TRACE, ("BTDM_FWCoexAllOff(), real Do\n"));

	BTDM_FWCoexAllOff8723A(padapter);

	pHalData->bt_coexist.bFWCoexistAllOff = true;
}

void BTDM_SWCoexAllOff(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);;

	RTPRINT(FBT, BT_TRACE, ("BTDM_SWCoexAllOff()\n"));
	if (pHalData->bt_coexist.bSWCoexistAllOff)
		return;
	RTPRINT(FBT, BT_TRACE, ("BTDM_SWCoexAllOff(), real Do\n"));
	BTDM_SWCoexAllOff8723A(padapter);

	pHalData->bt_coexist.bSWCoexistAllOff = true;
}

void BTDM_HWCoexAllOff(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);;

	RTPRINT(FBT, BT_TRACE, ("BTDM_HWCoexAllOff()\n"));
	if (pHalData->bt_coexist.bHWCoexistAllOff)
		return;
	RTPRINT(FBT, BT_TRACE, ("BTDM_HWCoexAllOff(), real Do\n"));

	BTDM_HWCoexAllOff8723A(padapter);

	pHalData->bt_coexist.bHWCoexistAllOff = true;
}

void BTDM_CoexAllOff(struct rtw_adapter *padapter)
{
	BTDM_FWCoexAllOff(padapter);
	BTDM_SWCoexAllOff(padapter);
	BTDM_HWCoexAllOff(padapter);
}

void BTDM_TurnOffBtCoexistBeforeEnterIPS(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);
	struct pwrctrl_priv *ppwrctrl = &padapter->pwrctrlpriv;

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	/*  8723 1Ant doesn't need to turn off bt coexist mechanism. */
	if (BTDM_1Ant8723A(padapter))
		return;

	/*  Before enter IPS, turn off FW BT Co-exist mechanism */
	if (ppwrctrl->reg_rfoff == rf_on) {
		RTPRINT(FBT, BT_TRACE, ("[BT][DM], Before enter IPS, turn off all Coexist DM\n"));
		btdm_ResetFWCoexState(padapter);
		BTDM_CoexAllOff(padapter);
		BTDM_SetAntenna(padapter, BTDM_ANT_BT);
	}
}

void BTDM_SignalCompensation(struct rtw_adapter *padapter, u8 *rssi_wifi, u8 *rssi_bt)
{
	BTDM_8723ASignalCompensation(padapter, rssi_wifi, rssi_bt);
}

void BTDM_Coexist(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

