torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
void BTDM_AdjustForBtOperation(struct rtw_adapter *padapter)
{
	RTPRINT(FBT, BT_TRACE, ("[BT][DM], BTDM_AdjustForBtOperation()\n"));
	BTDM_AdjustForBtOperation8723A(padapter);
}

void BTDM_SetBtCoexCurrAntNum(struct rtw_adapter *padapter, u8 antNum)
{
	BTDM_Set8723ABtCoexCurrAntNum(padapter, antNum);
}

void BTDM_ForHalt(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	BTDM_ForHalt8723A(padapter);
	GET_HAL_DATA(padapter)->bt_coexist.bInitlized = false;
}

void BTDM_WifiScanNotify(struct rtw_adapter *padapter, u8 scanType)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	BTDM_WifiScanNotify8723A(padapter, scanType);
}

void BTDM_WifiAssociateNotify(struct rtw_adapter *padapter, u8 action)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	BTDM_WifiAssociateNotify8723A(padapter, action);
}

void BTDM_MediaStatusNotify(struct rtw_adapter *padapter, enum rt_media_status mstatus)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	BTDM_MediaStatusNotify8723A(padapter, mstatus);
}

void BTDM_ForDhcp(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (!pHalData->bt_coexist.BluetoothCoexist)
		return;

	BTDM_ForDhcp8723A(padapter);
}

void BTDM_ResetActionProfileState(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	pHalData->bt_coexist.CurrentState &= ~\
		(BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP|
		BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_SCO);
}

u8 BTDM_IsActionSCO(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_SCO) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_SCO;
			bRet = true;
		}
	} else {
		if (pBtMgnt->ExtConfig.NumberOfSCO > 0) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_SCO;
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsActionHID(struct rtw_adapter *padapter)
{
	struct bt_30info *pBTInfo;
	struct hal_data_8723a *pHalData;
	struct bt_mgnt *pBtMgnt;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_HID;
			bRet = true;
		}
	} else {
		if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
		    pBtMgnt->ExtConfig.NumberOfHandle == 1) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_HID;
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsActionA2DP(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_A2DP) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_A2DP;
			bRet = true;
		}
	} else {
		if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP) &&
		    pBtMgnt->ExtConfig.NumberOfHandle == 1) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_A2DP;
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsActionPAN(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_PAN) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_PAN;
			bRet = true;
		}
	} else {
		if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN) &&
		    pBtMgnt->ExtConfig.NumberOfHandle == 1) {
			pHalData->bt_coexist.CurrentState |= BT_COEX_STATE_PROFILE_PAN;
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsActionHIDA2DP(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_mgnt *pBtMgnt;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID_A2DP) {
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP);
			bRet = true;
		}
	} else {
		if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
		    BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_A2DP);
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsActionHIDPAN(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_HID_PAN) {
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_PAN);
			bRet = true;
		}
	} else {
		if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_HID) &&
		    BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN)) {
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_HID|BT_COEX_STATE_PROFILE_PAN);
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsActionPANA2DP(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;
	struct bt_30info *pBTInfo;
	struct bt_dgb *pBtDbg;
	u8 bRet;

	pHalData = GET_HAL_DATA(padapter);
	pBTInfo = GET_BT_INFO(padapter);
	pBtDbg = &pBTInfo->BtDbg;
	bRet = false;

