torvalds/linux/drivers/staging/rtl8723au/hal/rtl8723a_bt-coexist.c
	if (pBtDbg->dbgCtrl) {
		if (pBtDbg->dbgProfile == BT_DBG_PROFILE_PAN_A2DP) {
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_A2DP);
			bRet = true;
		}
	} else {
		if (BTHCI_CheckProfileExist(padapter, BT_PROFILE_PAN) && BTHCI_CheckProfileExist(padapter, BT_PROFILE_A2DP)) {
			pHalData->bt_coexist.CurrentState |= (BT_COEX_STATE_PROFILE_PAN|BT_COEX_STATE_PROFILE_A2DP);
			bRet = true;
		}
	}
	return bRet;
}

u8 BTDM_IsBtDisabled(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.bCurBtDisabled)
		return true;
	else
		return false;
}

/*  ===== End of sync from SD7 driver HAL/BTCoexist/HalBtCoexist.c ===== */
#endif

#ifdef __HALBT_C__ /*  HAL/HalBT.c */
/*  ===== Below this line is sync from SD7 driver HAL/HalBT.c ===== */

/*  */
/*local function */
/*  */

static void halbt_InitHwConfig8723A(struct rtw_adapter *padapter)
{
}

/*  */
/*extern function */
/*  */
u8 HALBT_GetPGAntNum(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	return pHalData->bt_coexist.BT_Ant_Num;
}

void HALBT_SetKey(struct rtw_adapter *padapter, u8 EntryNum)
{
	struct bt_30info *pBTinfo;
	struct bt_asoc_entry *pBtAssocEntry;
	u16				usConfig = 0;

	pBTinfo = GET_BT_INFO(padapter);
	pBtAssocEntry = &pBTinfo->BtAsocEntry[EntryNum];

	pBtAssocEntry->HwCAMIndex = BT_HWCAM_STAR + EntryNum;

	usConfig = CAM_VALID | (CAM_AES << 2);
	write_cam23a(padapter, pBtAssocEntry->HwCAMIndex, usConfig, pBtAssocEntry->BTRemoteMACAddr, pBtAssocEntry->PTK + TKIP_ENC_KEY_POS);
}

void HALBT_RemoveKey(struct rtw_adapter *padapter, u8 EntryNum)
{
	struct bt_30info *pBTinfo;
	struct bt_asoc_entry *pBtAssocEntry;

	pBTinfo = GET_BT_INFO(padapter);
	pBtAssocEntry = &pBTinfo->BtAsocEntry[EntryNum];

	if (pBTinfo->BtAsocEntry[EntryNum].HwCAMIndex != 0) {
		/*  ToDo : add New HALBT_RemoveKey function !! */
		if (pBtAssocEntry->HwCAMIndex >= BT_HWCAM_STAR && pBtAssocEntry->HwCAMIndex < HALF_CAM_ENTRY)
			CAM_empty_entry23a(padapter, pBtAssocEntry->HwCAMIndex);
		pBTinfo->BtAsocEntry[EntryNum].HwCAMIndex = 0;
	}
}

void HALBT_InitBTVars8723A(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData;

	pHalData = GET_HAL_DATA(padapter);

	pHalData->bt_coexist.BluetoothCoexist = pHalData->EEPROMBluetoothCoexist;
	pHalData->bt_coexist.BT_Ant_Num = pHalData->EEPROMBluetoothAntNum;
	pHalData->bt_coexist.BT_CoexistType = pHalData->EEPROMBluetoothType;
	pHalData->bt_coexist.BT_Ant_isolation = pHalData->EEPROMBluetoothAntIsolation;
	pHalData->bt_coexist.bt_radiosharedtype = pHalData->EEPROMBluetoothRadioShared;

	RT_TRACE(_module_hal_init_c_, _drv_info_, ("BT Coexistance = 0x%x\n", pHalData->bt_coexist.BluetoothCoexist));
	if (pHalData->bt_coexist.BluetoothCoexist) {
		if (pHalData->bt_coexist.BT_Ant_Num == Ant_x2) {
			BTDM_SetBtCoexCurrAntNum(padapter, 2);
			RT_TRACE(_module_hal_init_c_, _drv_info_, ("BlueTooth BT_Ant_Num = Antx2\n"));
		} else if (pHalData->bt_coexist.BT_Ant_Num == Ant_x1) {
			BTDM_SetBtCoexCurrAntNum(padapter, 1);
			RT_TRACE(_module_hal_init_c_, _drv_info_, ("BlueTooth BT_Ant_Num = Antx1\n"));
		}
		pHalData->bt_coexist.bBTBusyTraffic = false;
		pHalData->bt_coexist.bBTTrafficModeSet = false;
		pHalData->bt_coexist.bBTNonTrafficModeSet = false;
		pHalData->bt_coexist.CurrentState = 0;
		pHalData->bt_coexist.PreviousState = 0;

		RT_TRACE(_module_hal_init_c_, _drv_info_,
			 ("bt_radiosharedType = 0x%x\n",
			 pHalData->bt_coexist.bt_radiosharedtype));
	}
}

u8 HALBT_IsBTExist(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	if (pHalData->bt_coexist.BluetoothCoexist)
		return true;
	else
		return false;
}

u8 HALBT_BTChipType(struct rtw_adapter *padapter)
{
	struct hal_data_8723a *pHalData = GET_HAL_DATA(padapter);

	return pHalData->bt_coexist.BT_CoexistType;
}

void HALBT_InitHwConfig(struct rtw_adapter *padapter)
{
	halbt_InitHwConfig8723A(padapter);
	BTDM_Coexist(padapter);
}

void HALBT_SetRtsCtsNoLenLimit(struct rtw_adapter *padapter)
{
}

/*  ===== End of sync from SD7 driver HAL/HalBT.c ===== */
#endif
